espressif/esp-idf/components/soc/esp32s31/register/soc/lcd_cam_reg.h
/**
 * SPDX-FileCopyrightText: 2025 Espressif Systems (Shanghai) CO LTD
 *
 *  SPDX-License-Identifier: Apache-2.0 OR MIT
 */
#pragma once

#include "soc/soc.h"
#ifdef __cplusplus
extern "C" {
#endif

/** LCDCAM_LCD_CLOCK_REG register
 *  LCD clock config register.
 */
#define LCDCAM_LCD_CLOCK_REG (DR_REG_LCDCAM_BASE + 0x0)
/** LCDCAM_LCD_CLKCNT_N : R/W; bitpos: [5:0]; default: 3;
 *  f_LCD_PCLK = f_LCD_CLK / (reg_clkcnt_N + 1) when reg_clk_equ_sysclk is 0.
 */
#define LCDCAM_LCD_CLKCNT_N    0x0000003FU
#define LCDCAM_LCD_CLKCNT_N_M  (LCDCAM_LCD_CLKCNT_N_V << LCDCAM_LCD_CLKCNT_N_S)
#define LCDCAM_LCD_CLKCNT_N_V  0x0000003FU
#define LCDCAM_LCD_CLKCNT_N_S  0
/** LCDCAM_LCD_CLK_EQU_SYSCLK : R/W; bitpos: [6]; default: 1;
 *  1: f_LCD_PCLK = f_LCD_CLK. 0: f_LCD_PCLK = f_LCD_CLK / (reg_clkcnt_N + 1).
 */
#define LCDCAM_LCD_CLK_EQU_SYSCLK    (BIT(6))
#define LCDCAM_LCD_CLK_EQU_SYSCLK_M  (LCDCAM_LCD_CLK_EQU_SYSCLK_V << LCDCAM_LCD_CLK_EQU_SYSCLK_S)
#define LCDCAM_LCD_CLK_EQU_SYSCLK_V  0x00000001U
#define LCDCAM_LCD_CLK_EQU_SYSCLK_S  6
/** LCDCAM_LCD_CK_IDLE_EDGE : R/W; bitpos: [7]; default: 0;
 *  1: LCD_PCLK line is high when idle     0: LCD_PCLK line is low when idle.
 */
#define LCDCAM_LCD_CK_IDLE_EDGE    (BIT(7))
#define LCDCAM_LCD_CK_IDLE_EDGE_M  (LCDCAM_LCD_CK_IDLE_EDGE_V << LCDCAM_LCD_CK_IDLE_EDGE_S)
#define LCDCAM_LCD_CK_IDLE_EDGE_V  0x00000001U
#define LCDCAM_LCD_CK_IDLE_EDGE_S  7
/** LCDCAM_LCD_CK_OUT_EDGE : R/W; bitpos: [8]; default: 0;
 *  1: LCD_PCLK line is high in the first half data cycle.     0: LCD_PCLK line is low
 *  in the second half data cycle.
 */
#define LCDCAM_LCD_CK_OUT_EDGE    (BIT(8))
#define LCDCAM_LCD_CK_OUT_EDGE_M  (LCDCAM_LCD_CK_OUT_EDGE_V << LCDCAM_LCD_CK_OUT_EDGE_S)
#define LCDCAM_LCD_CK_OUT_EDGE_V  0x00000001U
#define LCDCAM_LCD_CK_OUT_EDGE_S  8
/** LCDCAM_LCD_CLKM_DIV_NUM : R/W; bitpos: [16:9]; default: 4;
 *  Integral LCD clock divider value
 */
#define LCDCAM_LCD_CLKM_DIV_NUM    0x000000FFU
#define LCDCAM_LCD_CLKM_DIV_NUM_M  (LCDCAM_LCD_CLKM_DIV_NUM_V << LCDCAM_LCD_CLKM_DIV_NUM_S)
#define LCDCAM_LCD_CLKM_DIV_NUM_V  0x000000FFU
#define LCDCAM_LCD_CLKM_DIV_NUM_S  9
/** LCDCAM_LCD_CLKM_DIV_B : R/W; bitpos: [22:17]; default: 0;
 *  Fractional clock divider numerator value
 */
#define LCDCAM_LCD_CLKM_DIV_B    0x0000003FU
#define LCDCAM_LCD_CLKM_DIV_B_M  (LCDCAM_LCD_CLKM_DIV_B_V << LCDCAM_LCD_CLKM_DIV_B_S)
#define LCDCAM_LCD_CLKM_DIV_B_V  0x0000003FU
#define LCDCAM_LCD_CLKM_DIV_B_S  17
/** LCDCAM_LCD_CLKM_DIV_A : R/W; bitpos: [28:23]; default: 0;
 *  Fractional clock divider denominator value
 */
#define LCDCAM_LCD_CLKM_DIV_A    0x0000003FU
#define LCDCAM_LCD_CLKM_DIV_A_M  (LCDCAM_LCD_CLKM_DIV_A_V << LCDCAM_LCD_CLKM_DIV_A_S)
#define LCDCAM_LCD_CLKM_DIV_A_V  0x0000003FU
#define LCDCAM_LCD_CLKM_DIV_A_S  23
/** LCDCAM_LCD_CLK_SEL : R/W; bitpos: [30:29]; default: 0;
 *  Select LCD module source clock. 0: no clock. 1: APLL. 2: CLK160. 3: no clock.
 */
#define LCDCAM_LCD_CLK_SEL    0x00000003U
#define LCDCAM_LCD_CLK_SEL_M  (LCDCAM_LCD_CLK_SEL_V << LCDCAM_LCD_CLK_SEL_S)
#define LCDCAM_LCD_CLK_SEL_V  0x00000003U
#define LCDCAM_LCD_CLK_SEL_S  29
/** LCDCAM_CLK_EN : R/W; bitpos: [31]; default: 0;
 *  Set this bit to enable clk gate
 */
#define LCDCAM_CLK_EN    (BIT(31))
#define LCDCAM_CLK_EN_M  (LCDCAM_CLK_EN_V << LCDCAM_CLK_EN_S)
#define LCDCAM_CLK_EN_V  0x00000001U
#define LCDCAM_CLK_EN_S  31

/** LCDCAM_CAM_CTRL_REG register
 *  CAM config register.
 */
#define LCDCAM_CAM_CTRL_REG (DR_REG_LCDCAM_BASE + 0x4)
/** LCDCAM_CAM_STOP_EN : R/W; bitpos: [0]; default: 0;
 *  Camera stop enable signal, 1: camera stops when DMA Rx FIFO is full. 0: Not stop.
 */
#define LCDCAM_CAM_STOP_EN    (BIT(0))
#define LCDCAM_CAM_STOP_EN_M  (LCDCAM_CAM_STOP_EN_V << LCDCAM_CAM_STOP_EN_S)
#define LCDCAM_CAM_STOP_EN_V  0x00000001U
#define LCDCAM_CAM_STOP_EN_S  0
/** LCDCAM_CAM_VSYNC_FILTER_THRES : R/W; bitpos: [3:1]; default: 0;
 *  Filter threshold value for CAM_VSYNC signal.
 */
#define LCDCAM_CAM_VSYNC_FILTER_THRES    0x00000007U
#define LCDCAM_CAM_VSYNC_FILTER_THRES_M  (LCDCAM_CAM_VSYNC_FILTER_THRES_V << LCDCAM_CAM_VSYNC_FILTER_THRES_S)
#define LCDCAM_CAM_VSYNC_FILTER_THRES_V  0x00000007U
#define LCDCAM_CAM_VSYNC_FILTER_THRES_S  1
/** LCDCAM_CAM_UPDATE_REG : R/W/SC; bitpos: [4]; default: 0;
 *  1: Update Camera registers, will be cleared by hardware. 0 : Not care.
 */
#define LCDCAM_CAM_UPDATE_REG    (BIT(4))
#define LCDCAM_CAM_UPDATE_REG_M  (LCDCAM_CAM_UPDATE_REG_V << LCDCAM_CAM_UPDATE_REG_S)
#define LCDCAM_CAM_UPDATE_REG_V  0x00000001U
#define LCDCAM_CAM_UPDATE_REG_S  4
/** LCDCAM_CAM_BYTE_ORDER : R/W; bitpos: [5]; default: 0;
 *  1: invert data byte order. 0: Not change.
 */
#define LCDCAM_CAM_BYTE_ORDER    (BIT(5))
#define LCDCAM_CAM_BYTE_ORDER_M  (LCDCAM_CAM_BYTE_ORDER_V << LCDCAM_CAM_BYTE_ORDER_S)
#define LCDCAM_CAM_BYTE_ORDER_V  0x00000001U
#define LCDCAM_CAM_BYTE_ORDER_S  5
/** LCDCAM_CAM_BIT_ORDER : R/W; bitpos: [6]; default: 0;
 *  1: Change data bit order, change CAM_DATA_in[7:0] to CAM_DATA_in[0:7] in one byte
 *  mode, and bits[15:0] to bits[0:15] in two byte mode.  0: Not change.
 */
#define LCDCAM_CAM_BIT_ORDER    (BIT(6))
#define LCDCAM_CAM_BIT_ORDER_M  (LCDCAM_CAM_BIT_ORDER_V << LCDCAM_CAM_BIT_ORDER_S)
#define LCDCAM_CAM_BIT_ORDER_V  0x00000001U
#define LCDCAM_CAM_BIT_ORDER_S  6
/** LCDCAM_CAM_LINE_INT_EN : R/W; bitpos: [7]; default: 0;
 *  1: Enable to generate CAM_HS_INT. 0: Disable.
 */
#define LCDCAM_CAM_LINE_INT_EN    (BIT(7))
#define LCDCAM_CAM_LINE_INT_EN_M  (LCDCAM_CAM_LINE_INT_EN_V << LCDCAM_CAM_LINE_INT_EN_S)
#define LCDCAM_CAM_LINE_INT_EN_V  0x00000001U
#define LCDCAM_CAM_LINE_INT_EN_S  7
/** LCDCAM_CAM_VS_EOF_EN : R/W; bitpos: [8]; default: 0;
 *  1: CAM_VSYNC to generate in_suc_eof. 0: in_suc_eof is controlled by
 *  reg_cam_rec_data_cyclelen.
 */
#define LCDCAM_CAM_VS_EOF_EN    (BIT(8))
#define LCDCAM_CAM_VS_EOF_EN_M  (LCDCAM_CAM_VS_EOF_EN_V << LCDCAM_CAM_VS_EOF_EN_S)
#define LCDCAM_CAM_VS_EOF_EN_V  0x00000001U
#define LCDCAM_CAM_VS_EOF_EN_S  8
/** LCDCAM_CAM_CLKM_DIV_NUM : R/W; bitpos: [16:9]; default: 4;
 *  Integral Camera clock divider value
 */
#define LCDCAM_CAM_CLKM_DIV_NUM    0x000000FFU
#define LCDCAM_CAM_CLKM_DIV_NUM_M  (LCDCAM_CAM_CLKM_DIV_NUM_V << LCDCAM_CAM_CLKM_DIV_NUM_S)
#define LCDCAM_CAM_CLKM_DIV_NUM_V  0x000000FFU
#define LCDCAM_CAM_CLKM_DIV_NUM_S  9
/** LCDCAM_CAM_CLKM_DIV_B : R/W; bitpos: [22:17]; default: 0;
 *  Fractional clock divider numerator value
 */
#define LCDCAM_CAM_CLKM_DIV_B    0x0000003FU
#define LCDCAM_CAM_CLKM_DIV_B_M  (LCDCAM_CAM_CLKM_DIV_B_V << LCDCAM_CAM_CLKM_DIV_B_S)
#define LCDCAM_CAM_CLKM_DIV_B_V  0x0000003FU
#define LCDCAM_CAM_CLKM_DIV_B_S  17
/** LCDCAM_CAM_CLKM_DIV_A : R/W; bitpos: [28:23]; default: 0;
 *  Fractional clock divider denominator value
 */
#define LCDCAM_CAM_CLKM_DIV_A    0x0000003FU
#define LCDCAM_CAM_CLKM_DIV_A_M  (LCDCAM_CAM_CLKM_DIV_A_V << LCDCAM_CAM_CLKM_DIV_A_S)
#define LCDCAM_CAM_CLKM_DIV_A_V  0x0000003FU
#define LCDCAM_CAM_CLKM_DIV_A_S  23
/** LCDCAM_CAM_CLK_SEL : R/W; bitpos: [30:29]; default: 0;
 *  Select Camera module source clock. 0: no clock. 1: APLL. 2: CLK160. 3: no clock.
 */
#define LCDCAM_CAM_CLK_SEL    0x00000003U
#define LCDCAM_CAM_CLK_SEL_M  (LCDCAM_CAM_CLK_SEL_V << LCDCAM_CAM_CLK_SEL_S)
#define LCDCAM_CAM_CLK_SEL_V  0x00000003U
#define LCDCAM_CAM_CLK_SEL_S  29

/** LCDCAM_CAM_CTRL1_REG register
 *  CAM config register.
 */
#define LCDCAM_CAM_CTRL1_REG (DR_REG_LCDCAM_BASE + 0x8)
/** LCDCAM_CAM_REC_DATA_BYTELEN : R/W; bitpos: [15:0]; default: 0;
 *  Camera receive data byte length minus 1 to set DMA in_suc_eof_int.
 */
#define LCDCAM_CAM_REC_DATA_BYTELEN    0x0000FFFFU
#define LCDCAM_CAM_REC_DATA_BYTELEN_M  (LCDCAM_CAM_REC_DATA_BYTELEN_V << LCDCAM_CAM_REC_DATA_BYTELEN_S)
#define LCDCAM_CAM_REC_DATA_BYTELEN_V  0x0000FFFFU
#define LCDCAM_CAM_REC_DATA_BYTELEN_S  0
/** LCDCAM_CAM_LINE_INT_NUM : R/W; bitpos: [21:16]; default: 0;
 *  The line number minus 1 to generate cam_hs_int.
 */
#define LCDCAM_CAM_LINE_INT_NUM    0x0000003FU
#define LCDCAM_CAM_LINE_INT_NUM_M  (LCDCAM_CAM_LINE_INT_NUM_V << LCDCAM_CAM_LINE_INT_NUM_S)
#define LCDCAM_CAM_LINE_INT_NUM_V  0x0000003FU
#define LCDCAM_CAM_LINE_INT_NUM_S  16
/** LCDCAM_CAM_CLK_INV : R/W; bitpos: [22]; default: 0;
 *  1: Invert  the input signal CAM_PCLK. 0: Not invert.
 */
#define LCDCAM_CAM_CLK_INV    (BIT(22))
#define LCDCAM_CAM_CLK_INV_M  (LCDCAM_CAM_CLK_INV_V << LCDCAM_CAM_CLK_INV_S)
#define LCDCAM_CAM_CLK_INV_V  0x00000001U
#define LCDCAM_CAM_CLK_INV_S  22
/** LCDCAM_CAM_VSYNC_FILTER_EN : R/W; bitpos: [23]; default: 0;
 *  1: Enable CAM_VSYNC filter function. 0: bypass.
 */
#define LCDCAM_CAM_VSYNC_FILTER_EN    (BIT(23))
#define LCDCAM_CAM_VSYNC_FILTER_EN_M  (LCDCAM_CAM_VSYNC_FILTER_EN_V << LCDCAM_CAM_VSYNC_FILTER_EN_S)
#define LCDCAM_CAM_VSYNC_FILTER_EN_V  0x00000001U
#define LCDCAM_CAM_VSYNC_FILTER_EN_S  23
/** LCDCAM_CAM_2BYTE_EN : R/W; bitpos: [24]; default: 0;
 *  1: The bit number of input data is 9~16.  0: The bit number of input data is 0~8.
 */
#define LCDCAM_CAM_2BYTE_EN    (BIT(24))
#define LCDCAM_CAM_2BYTE_EN_M  (LCDCAM_CAM_2BYTE_EN_V << LCDCAM_CAM_2BYTE_EN_S)
#define LCDCAM_CAM_2BYTE_EN_V  0x00000001U
#define LCDCAM_CAM_2BYTE_EN_S  24
/** LCDCAM_CAM_DE_INV : R/W; bitpos: [25]; default: 0;
 *  CAM_DE invert enable signal, valid in high level.
 */
#define LCDCAM_CAM_DE_INV    (BIT(25))
#define LCDCAM_CAM_DE_INV_M  (LCDCAM_CAM_DE_INV_V << LCDCAM_CAM_DE_INV_S)
#define LCDCAM_CAM_DE_INV_V  0x00000001U
#define LCDCAM_CAM_DE_INV_S  25
/** LCDCAM_CAM_HSYNC_INV : R/W; bitpos: [26]; default: 0;
 *  CAM_HSYNC invert enable signal, valid in high level.
 */
#define LCDCAM_CAM_HSYNC_INV    (BIT(26))
#define LCDCAM_CAM_HSYNC_INV_M  (LCDCAM_CAM_HSYNC_INV_V << LCDCAM_CAM_HSYNC_INV_S)
#define LCDCAM_CAM_HSYNC_INV_V  0x00000001U
#define LCDCAM_CAM_HSYNC_INV_S  26
/** LCDCAM_CAM_VSYNC_INV : R/W; bitpos: [27]; default: 0;
 *  CAM_VSYNC invert enable signal, valid in high level.
 */
#define LCDCAM_CAM_VSYNC_INV    (BIT(27))
#define LCDCAM_CAM_VSYNC_INV_M  (LCDCAM_CAM_VSYNC_INV_V << LCDCAM_CAM_VSYNC_INV_S)
#define LCDCAM_CAM_VSYNC_INV_V  0x00000001U
#define LCDCAM_CAM_VSYNC_INV_S  27
/** LCDCAM_CAM_VH_DE_MODE_EN : R/W; bitpos: [28]; default: 0;
 *  1: Input control signals are CAM_DE CAM_HSYNC and CAM_VSYNC. 0: Input control
 *  signals are CAM_DE and CAM_VSYNC.
 */
#define LCDCAM_CAM_VH_DE_MODE_EN    (BIT(28))
#define LCDCAM_CAM_VH_DE_MODE_EN_M  (LCDCAM_CAM_VH_DE_MODE_EN_V << LCDCAM_CAM_VH_DE_MODE_EN_S)
#define LCDCAM_CAM_VH_DE_MODE_EN_V  0x00000001U
#define LCDCAM_CAM_VH_DE_MODE_EN_S  28
/** LCDCAM_CAM_START : R/W/SC; bitpos: [29]; default: 0;
 *  Camera module start signal.
 */
#define LCDCAM_CAM_START    (BIT(29))
#define LCDCAM_CAM_START_M  (LCDCAM_CAM_START_V << LCDCAM_CAM_START_S)
#define LCDCAM_CAM_START_V  0x00000001U
#define LCDCAM_CAM_START_S  29
/** LCDCAM_CAM_RESET : WT; bitpos: [30]; default: 0;
 *  Camera module reset signal.
 */
#define LCDCAM_CAM_RESET    (BIT(30))
#define LCDCAM_CAM_RESET_M  (LCDCAM_CAM_RESET_V << LCDCAM_CAM_RESET_S)
#define LCDCAM_CAM_RESET_V  0x00000001U
#define LCDCAM_CAM_RESET_S  30
/** LCDCAM_CAM_AFIFO_RESET : WT; bitpos: [31]; default: 0;
 *  Camera AFIFO reset signal.
 */
#define LCDCAM_CAM_AFIFO_RESET    (BIT(31))
#define LCDCAM_CAM_AFIFO_RESET_M  (LCDCAM_CAM_AFIFO_RESET_V << LCDCAM_CAM_AFIFO_RESET_S)
#define LCDCAM_CAM_AFIFO_RESET_V  0x00000001U
#define LCDCAM_CAM_AFIFO_RESET_S  31

/** LCDCAM_CAM_RGB_YUV_REG register
 *  CAM YUV/RGB converter configuration register.
 */
#define LCDCAM_CAM_RGB_YUV_REG (DR_REG_LCDCAM_BASE + 0xc)
/** LCDCAM_CAM_CONV_HOR_PIXEL_NUM : R/W; bitpos: [20:10]; default: 0;
 *  the horizontal pixel number when rgb trans to yuv420
 */
#define LCDCAM_CAM_CONV_HOR_PIXEL_NUM    0x000007FFU
#define LCDCAM_CAM_CONV_HOR_PIXEL_NUM_M  (LCDCAM_CAM_CONV_HOR_PIXEL_NUM_V << LCDCAM_CAM_CONV_HOR_PIXEL_NUM_S)
#define LCDCAM_CAM_CONV_HOR_PIXEL_NUM_V  0x000007FFU
#define LCDCAM_CAM_CONV_HOR_PIXEL_NUM_S  10
/** LCDCAM_CAM_CONV_8BITS_DATA_INV : R/W; bitpos: [21]; default: 0;
 *  1:invert every two 8bits input data. 2. disabled.
 */
#define LCDCAM_CAM_CONV_8BITS_DATA_INV    (BIT(21))
#define LCDCAM_CAM_CONV_8BITS_DATA_INV_M  (LCDCAM_CAM_CONV_8BITS_DATA_INV_V << LCDCAM_CAM_CONV_8BITS_DATA_INV_S)
#define LCDCAM_CAM_CONV_8BITS_DATA_INV_V  0x00000001U
#define LCDCAM_CAM_CONV_8BITS_DATA_INV_S  21
/** LCDCAM_CAM_CONV_YUV2YUV_MODE : R/W; bitpos: [23:22]; default: 3;
 *  0: to yuv422. 1: to yuv420. 2: to yuv411. 3: disabled.  To enable yuv2yuv mode,
 *  trans_mode must be set to 1.
 */
#define LCDCAM_CAM_CONV_YUV2YUV_MODE    0x00000003U
#define LCDCAM_CAM_CONV_YUV2YUV_MODE_M  (LCDCAM_CAM_CONV_YUV2YUV_MODE_V << LCDCAM_CAM_CONV_YUV2YUV_MODE_S)
#define LCDCAM_CAM_CONV_YUV2YUV_MODE_V  0x00000003U
#define LCDCAM_CAM_CONV_YUV2YUV_MODE_S  22
/** LCDCAM_CAM_CONV_YUV_MODE : R/W; bitpos: [25:24]; default: 0;
 *  0: yuv422. 1: yuv420. 2: yuv411.The format that Data_in should be converted to.
 */
#define LCDCAM_CAM_CONV_YUV_MODE    0x00000003U
#define LCDCAM_CAM_CONV_YUV_MODE_M  (LCDCAM_CAM_CONV_YUV_MODE_V << LCDCAM_CAM_CONV_YUV_MODE_S)
#define LCDCAM_CAM_CONV_YUV_MODE_V  0x00000003U
#define LCDCAM_CAM_CONV_YUV_MODE_S  24
/** LCDCAM_CAM_CONV_PROTOCOL_MODE : R/W; bitpos: [26]; default: 0;
 *  0:BT601. 1:BT709.
 */
#define LCDCAM_CAM_CONV_PROTOCOL_MODE    (BIT(26))
#define LCDCAM_CAM_CONV_PROTOCOL_MODE_M  (LCDCAM_CAM_CONV_PROTOCOL_MODE_V << LCDCAM_CAM_CONV_PROTOCOL_MODE_S)
#define LCDCAM_CAM_CONV_PROTOCOL_MODE_V  0x00000001U
#define LCDCAM_CAM_CONV_PROTOCOL_MODE_S  26
/** LCDCAM_CAM_CONV_DATA_OUT_MODE : R/W; bitpos: [27]; default: 0;
 *  LIMIT or FULL mode of Data out. 0: limit. 1: full
 */
#define LCDCAM_CAM_CONV_DATA_OUT_MODE    (BIT(27))
#define LCDCAM_CAM_CONV_DATA_OUT_MODE_M  (LCDCAM_CAM_CONV_DATA_OUT_MODE_V << LCDCAM_CAM_CONV_DATA_OUT_MODE_S)
#define LCDCAM_CAM_CONV_DATA_OUT_MODE_V  0x00000001U
#define LCDCAM_CAM_CONV_DATA_OUT_MODE_S  27
/** LCDCAM_CAM_CONV_DATA_IN_MODE : R/W; bitpos: [28]; default: 0;
 *  LIMIT or FULL mode of Data in. 0: limit. 1: full
 */
#define LCDCAM_CAM_CONV_DATA_IN_MODE    (BIT(28))
#define LCDCAM_CAM_CONV_DATA_IN_MODE_M  (LCDCAM_CAM_CONV_DATA_IN_MODE_V << LCDCAM_CAM_CONV_DATA_IN_MODE_S)
#define LCDCAM_CAM_CONV_DATA_IN_MODE_V  0x00000001U
#define LCDCAM_CAM_CONV_DATA_IN_MODE_S  28
/** LCDCAM_CAM_CONV_MODE_8BITS_ON : R/W; bitpos: [29]; default: 0;
 *  0: 16bits mode. 1: 8bits mode.
 */
#define LCDCAM_CAM_CONV_MODE_8BITS_ON    (BIT(29))
#define LCDCAM_CAM_CONV_MODE_8BITS_ON_M  (LCDCAM_CAM_CONV_MODE_8BITS_ON_V << LCDCAM_CAM_CONV_MODE_8BITS_ON_S)
#define LCDCAM_CAM_CONV_MODE_8BITS_ON_V  0x00000001U
#define LCDCAM_CAM_CONV_MODE_8BITS_ON_S  29
/** LCDCAM_CAM_CONV_TRANS_MODE : R/W; bitpos: [30]; default: 0;
 *  0: YUV to RGB. 1: RGB to YUV.
 */
#define LCDCAM_CAM_CONV_TRANS_MODE    (BIT(30))
#define LCDCAM_CAM_CONV_TRANS_MODE_M  (LCDCAM_CAM_CONV_TRANS_MODE_V << LCDCAM_CAM_CONV_TRANS_MODE_S)
#define LCDCAM_CAM_CONV_TRANS_MODE_V  0x00000001U
#define LCDCAM_CAM_CONV_TRANS_MODE_S  30
/** LCDCAM_CAM_CONV_ENABLE : R/W; bitpos: [31]; default: 0;
 *  0: Bypass converter. 1: Enable converter.
 */
#define LCDCAM_CAM_CONV_ENABLE    (BIT(31))
#define LCDCAM_CAM_CONV_ENABLE_M  (LCDCAM_CAM_CONV_ENABLE_V << LCDCAM_CAM_CONV_ENABLE_S)
#define LCDCAM_CAM_CONV_ENABLE_V  0x00000001U
#define LCDCAM_CAM_CONV_ENABLE_S  31

/** LCDCAM_LCD_RGB_YUV_REG register
 *  LCD YUV/RGB converter configuration register.
 */
#define LCDCAM_LCD_RGB_YUV_REG (DR_REG_LCDCAM_BASE + 0x10)
/** LCDCAM_LCD_CONV_HOR_PIXEL_NUM : R/W; bitpos: [15:5]; default: 0;
 *  the horizontal pixel number when rgb trans to yuv420
 */
#define LCDCAM_LCD_CONV_HOR_PIXEL_NUM    0x000007FFU
#define LCDCAM_LCD_CONV_HOR_PIXEL_NUM_M  (LCDCAM_LCD_CONV_HOR_PIXEL_NUM_V << LCDCAM_LCD_CONV_HOR_PIXEL_NUM_S)
#define LCDCAM_LCD_CONV_HOR_PIXEL_NUM_V  0x000007FFU
#define LCDCAM_LCD_CONV_HOR_PIXEL_NUM_S  5
/** LCDCAM_LCD_CONV_MEM_CLK_EN : R/W; bitpos: [16]; default: 0;
 *  0:Open the clock gate for lcd convert memory.1: Close the clock gate for lcd
 *  convert memory
 */
#define LCDCAM_LCD_CONV_MEM_CLK_EN    (BIT(16))
#define LCDCAM_LCD_CONV_MEM_CLK_EN_M  (LCDCAM_LCD_CONV_MEM_CLK_EN_V << LCDCAM_LCD_CONV_MEM_CLK_EN_S)
#define LCDCAM_LCD_CONV_MEM_CLK_EN_V  0x00000001U
#define LCDCAM_LCD_CONV_MEM_CLK_EN_S  16
/** LCDCAM_LCD_CONV_8BITS_DATA_INV : R/W; bitpos: [17]; default: 0;
 *  1:invert every two 8bits input data. 2. disabled.
 */
#define LCDCAM_LCD_CONV_8BITS_DATA_INV    (BIT(17))
#define LCDCAM_LCD_CONV_8BITS_DATA_INV_M  (LCDCAM_LCD_CONV_8BITS_DATA_INV_V << LCDCAM_LCD_CONV_8BITS_DATA_INV_S)
#define LCDCAM_LCD_CONV_8BITS_DATA_INV_V  0x00000001U
#define LCDCAM_LCD_CONV_8BITS_DATA_INV_S  17
/** LCDCAM_LCD_CONV_TXTORX : R/W; bitpos: [18]; default: 0;
 *  0: txtorx mode off. 1: txtorx mode on.
 */
#define LCDCAM_LCD_CONV_TXTORX    (BIT(18))
#define LCDCAM_LCD_CONV_TXTORX_M  (LCDCAM_LCD_CONV_TXTORX_V << LCDCAM_LCD_CONV_TXTORX_S)
#define LCDCAM_LCD_CONV_TXTORX_V  0x00000001U
#define LCDCAM_LCD_CONV_TXTORX_S  18
/** LCDCAM_LCD_CONV_RGB_MODE : R/W; bitpos: [19]; default: 0;
 *  0:rgb565.1:rgb888.Determine the rgb format yuv420 trans to.
 */
#define LCDCAM_LCD_CONV_RGB_MODE    (BIT(19))
#define LCDCAM_LCD_CONV_RGB_MODE_M  (LCDCAM_LCD_CONV_RGB_MODE_V << LCDCAM_LCD_CONV_RGB_MODE_S)
#define LCDCAM_LCD_CONV_RGB_MODE_V  0x00000001U
#define LCDCAM_LCD_CONV_RGB_MODE_S  19
/** LCDCAM_LCD_CONV_RGB2RGB_MODE : R/W; bitpos: [21:20]; default: 2;
 *  0: to rgb565. 1: to rgb888. Others: disabled.To enable rgb2rgb mode, trans_mode
 *  must be set to 0.
 */
#define LCDCAM_LCD_CONV_RGB2RGB_MODE    0x00000003U
#define LCDCAM_LCD_CONV_RGB2RGB_MODE_M  (LCDCAM_LCD_CONV_RGB2RGB_MODE_V << LCDCAM_LCD_CONV_RGB2RGB_MODE_S)
#define LCDCAM_LCD_CONV_RGB2RGB_MODE_V  0x00000003U
#define LCDCAM_LCD_CONV_RGB2RGB_MODE_S  20
/** LCDCAM_LCD_CONV_YUV2YUV_MODE : R/W; bitpos: [23:22]; default: 3;
 *  0: to yuv422. 1: to yuv420. 2: to yuv411. 3: disabled.  To enable yuv2yuv mode,
 *  trans_mode must be set to 1.
 */
#define LCDCAM_LCD_CONV_YUV2YUV_MODE    0x00000003U
#define LCDCAM_LCD_CONV_YUV2YUV_MODE_M  (LCDCAM_LCD_CONV_YUV2YUV_MODE_V << LCDCAM_LCD_CONV_YUV2YUV_MODE_S)
#define LCDCAM_LCD_CONV_YUV2YUV_MODE_V  0x00000003U
#define LCDCAM_LCD_CONV_YUV2YUV_MODE_S  22
/** LCDCAM_LCD_CONV_YUV_MODE : R/W; bitpos: [25:24]; default: 0;
 *  0: yuv422. 1: yuv420. 2: yuv411. When in yuv2yuv mode, yuv_mode decides the yuv
 *  mode of Data_in
 */
#define LCDCAM_LCD_CONV_YUV_MODE    0x00000003U
#define LCDCAM_LCD_CONV_YUV_MODE_M  (LCDCAM_LCD_CONV_YUV_MODE_V << LCDCAM_LCD_CONV_YUV_MODE_S)
#define LCDCAM_LCD_CONV_YUV_MODE_V  0x00000003U
#define LCDCAM_LCD_CONV_YUV_MODE_S  24
/** LCDCAM_LCD_CONV_PROTOCOL_MODE : R/W; bitpos: [26]; default: 0;
 *  0:BT601. 1:BT709.
 */
#define LCDCAM_LCD_CONV_PROTOCOL_MODE    (BIT(26))
#define LCDCAM_LCD_CONV_PROTOCOL_MODE_M  (LCDCAM_LCD_CONV_PROTOCOL_MODE_V << LCDCAM_LCD_CONV_PROTOCOL_MODE_S)
#define LCDCAM_LCD_CONV_PROTOCOL_MODE_V  0x00000001U
#define LCDCAM_LCD_CONV_PROTOCOL_MODE_S  26
/** LCDCAM_LCD_CONV_DATA_OUT_MODE : R/W; bitpos: [27]; default: 0;
 *  LIMIT or FULL mode of Data out. 0: limit. 1: full
 */
#define LCDCAM_LCD_CONV_DATA_OUT_MODE    (BIT(27))
#define LCDCAM_LCD_CONV_DATA_OUT_MODE_M  (LCDCAM_LCD_CONV_DATA_OUT_MODE_V << LCDCAM_LCD_CONV_DATA_OUT_MODE_S)
#define LCDCAM_LCD_CONV_DATA_OUT_MODE_V  0x00000001U
#define LCDCAM_LCD_CONV_DATA_OUT_MODE_S  27
/** LCDCAM_LCD_CONV_DATA_IN_MODE : R/W; bitpos: [28]; default: 0;
 *  LIMIT or FULL mode of Data in. 0: limit. 1: full
 */
#define LCDCAM_LCD_CONV_DATA_IN_MODE    (BIT(28))
#define LCDCAM_LCD_CONV_DATA_IN_MODE_M  (LCDCAM_LCD_CONV_DATA_IN_MODE_V << LCDCAM_LCD_CONV_DATA_IN_MODE_S)
#define LCDCAM_LCD_CONV_DATA_IN_MODE_V  0x00000001U
#define LCDCAM_LCD_CONV_DATA_IN_MODE_S  28
/** LCDCAM_LCD_CONV_MODE_8BITS_ON : R/W; bitpos: [29]; default: 0;
 *  0: 16bits mode. 1: 8bits mode.
 */
#define LCDCAM_LCD_CONV_MODE_8BITS_ON    (BIT(29))
#define LCDCAM_LCD_CONV_MODE_8BITS_ON_M  (LCDCAM_LCD_CONV_MODE_8BITS_ON_V << LCDCAM_LCD_CONV_MODE_8BITS_ON_S)
#define LCDCAM_LCD_CONV_MODE_8BITS_ON_V  0x00000001U
#define LCDCAM_LCD_CONV_MODE_8BITS_ON_S  29
/** LCDCAM_LCD_CONV_TRANS_MODE : R/W; bitpos: [30]; default: 0;
 *  0: YUV to RGB. 1: RGB to YUV.
 */
#define LCDCAM_LCD_CONV_TRANS_MODE    (BIT(30))
#define LCDCAM_LCD_CONV_TRANS_MODE_M  (LCDCAM_LCD_CONV_TRANS_MODE_V << LCDCAM_LCD_CONV_TRANS_MODE_S)
#define LCDCAM_LCD_CONV_TRANS_MODE_V  0x00000001U
#define LCDCAM_LCD_CONV_TRANS_MODE_S  30
/** LCDCAM_LCD_CONV_ENABLE : R/W; bitpos: [31]; default: 0;
 *  0: Bypass converter. 1: Enable converter.
 */
#define LCDCAM_LCD_CONV_ENABLE    (BIT(31))
#define LCDCAM_LCD_CONV_ENABLE_M  (LCDCAM_LCD_CONV_ENABLE_V << LCDCAM_LCD_CONV_ENABLE_S)
#define LCDCAM_LCD_CONV_ENABLE_V  0x00000001U
#define LCDCAM_LCD_CONV_ENABLE_S  31

