espressif/esp-idf/components/soc/esp32s31/register/soc/lcd_cam_reg.h
/** LCDCAM_LCD_USER_REG register
 *  LCD config register.
 */
#define LCDCAM_LCD_USER_REG (DR_REG_LCDCAM_BASE + 0x14)
/** LCDCAM_LCD_DOUT_CYCLELEN : R/W; bitpos: [12:0]; default: 1;
 *  The output data cycles minus 1 of LCD module.
 */
#define LCDCAM_LCD_DOUT_CYCLELEN    0x00001FFFU
#define LCDCAM_LCD_DOUT_CYCLELEN_M  (LCDCAM_LCD_DOUT_CYCLELEN_V << LCDCAM_LCD_DOUT_CYCLELEN_S)
#define LCDCAM_LCD_DOUT_CYCLELEN_V  0x00001FFFU
#define LCDCAM_LCD_DOUT_CYCLELEN_S  0
/** LCDCAM_LCD_ALWAYS_OUT_EN : R/W; bitpos: [13]; default: 0;
 *  LCD always output when LCD is in LCD_DOUT state, unless reg_lcd_start is cleared or
 *  reg_lcd_reset is set.
 */
#define LCDCAM_LCD_ALWAYS_OUT_EN    (BIT(13))
#define LCDCAM_LCD_ALWAYS_OUT_EN_M  (LCDCAM_LCD_ALWAYS_OUT_EN_V << LCDCAM_LCD_ALWAYS_OUT_EN_S)
#define LCDCAM_LCD_ALWAYS_OUT_EN_V  0x00000001U
#define LCDCAM_LCD_ALWAYS_OUT_EN_S  13
/** LCDCAM_LCD_DOUT_BYTE_SWIZZLE_MODE : R/W; bitpos: [16:14]; default: 0;
 *  0: ABAB->BABA. 1: ABC->ACB. 2: ABC->BAC. 3: ABC->BCA. 4:ABC->CAB. 5:ABC->CBA
 */
#define LCDCAM_LCD_DOUT_BYTE_SWIZZLE_MODE    0x00000007U
#define LCDCAM_LCD_DOUT_BYTE_SWIZZLE_MODE_M  (LCDCAM_LCD_DOUT_BYTE_SWIZZLE_MODE_V << LCDCAM_LCD_DOUT_BYTE_SWIZZLE_MODE_S)
#define LCDCAM_LCD_DOUT_BYTE_SWIZZLE_MODE_V  0x00000007U
#define LCDCAM_LCD_DOUT_BYTE_SWIZZLE_MODE_S  14
/** LCDCAM_LCD_DOUT_BYTE_SWIZZLE_ENABLE : R/W; bitpos: [17]; default: 0;
 *  1: enable byte swizzle 0: disable
 */
#define LCDCAM_LCD_DOUT_BYTE_SWIZZLE_ENABLE    (BIT(17))
#define LCDCAM_LCD_DOUT_BYTE_SWIZZLE_ENABLE_M  (LCDCAM_LCD_DOUT_BYTE_SWIZZLE_ENABLE_V << LCDCAM_LCD_DOUT_BYTE_SWIZZLE_ENABLE_S)
#define LCDCAM_LCD_DOUT_BYTE_SWIZZLE_ENABLE_V  0x00000001U
#define LCDCAM_LCD_DOUT_BYTE_SWIZZLE_ENABLE_S  17
/** LCDCAM_LCD_DOUT_BIT_ORDER : R/W; bitpos: [18]; default: 0;
 *  1: change bit order in every byte. 0: Not change.
 */
#define LCDCAM_LCD_DOUT_BIT_ORDER    (BIT(18))
#define LCDCAM_LCD_DOUT_BIT_ORDER_M  (LCDCAM_LCD_DOUT_BIT_ORDER_V << LCDCAM_LCD_DOUT_BIT_ORDER_S)
#define LCDCAM_LCD_DOUT_BIT_ORDER_V  0x00000001U
#define LCDCAM_LCD_DOUT_BIT_ORDER_S  18
/** LCDCAM_LCD_BYTE_MODE : R/W; bitpos: [20:19]; default: 0;
 *  2: 24bit mode. 1: 16bit mode. 0: 8bit mode
 */
#define LCDCAM_LCD_BYTE_MODE    0x00000003U
#define LCDCAM_LCD_BYTE_MODE_M  (LCDCAM_LCD_BYTE_MODE_V << LCDCAM_LCD_BYTE_MODE_S)
#define LCDCAM_LCD_BYTE_MODE_V  0x00000003U
#define LCDCAM_LCD_BYTE_MODE_S  19
/** LCDCAM_LCD_UPDATE_REG : R/W/SC; bitpos: [21]; default: 0;
 *  1: Update LCD registers, will be cleared by hardware. 0 : Not care.
 */
#define LCDCAM_LCD_UPDATE_REG    (BIT(21))
#define LCDCAM_LCD_UPDATE_REG_M  (LCDCAM_LCD_UPDATE_REG_V << LCDCAM_LCD_UPDATE_REG_S)
#define LCDCAM_LCD_UPDATE_REG_V  0x00000001U
#define LCDCAM_LCD_UPDATE_REG_S  21
/** LCDCAM_LCD_BIT_ORDER : R/W; bitpos: [22]; default: 0;
 *  1: Change data bit order, change LCD_DATA_out[7:0] to LCD_DATA_out[0:7] in one byte
 *  mode, and bits[15:0] to bits[0:15] in two byte mode.  0: Not change.
 */
#define LCDCAM_LCD_BIT_ORDER    (BIT(22))
#define LCDCAM_LCD_BIT_ORDER_M  (LCDCAM_LCD_BIT_ORDER_V << LCDCAM_LCD_BIT_ORDER_S)
#define LCDCAM_LCD_BIT_ORDER_V  0x00000001U
#define LCDCAM_LCD_BIT_ORDER_S  22
/** LCDCAM_LCD_BYTE_ORDER : R/W; bitpos: [23]; default: 0;
 *  1: invert data byte order, only valid in 2 byte mode. 0: Not change.
 */
#define LCDCAM_LCD_BYTE_ORDER    (BIT(23))
#define LCDCAM_LCD_BYTE_ORDER_M  (LCDCAM_LCD_BYTE_ORDER_V << LCDCAM_LCD_BYTE_ORDER_S)
#define LCDCAM_LCD_BYTE_ORDER_V  0x00000001U
#define LCDCAM_LCD_BYTE_ORDER_S  23
/** LCDCAM_LCD_DOUT : R/W; bitpos: [24]; default: 0;
 *  1: Be able to send data out in LCD sequence when LCD starts. 0: Disable.
 */
#define LCDCAM_LCD_DOUT    (BIT(24))
#define LCDCAM_LCD_DOUT_M  (LCDCAM_LCD_DOUT_V << LCDCAM_LCD_DOUT_S)
#define LCDCAM_LCD_DOUT_V  0x00000001U
#define LCDCAM_LCD_DOUT_S  24
/** LCDCAM_LCD_DUMMY : R/W; bitpos: [25]; default: 0;
 *  1: Enable DUMMY phase in LCD sequence when LCD starts. 0: Disable.
 */
#define LCDCAM_LCD_DUMMY    (BIT(25))
#define LCDCAM_LCD_DUMMY_M  (LCDCAM_LCD_DUMMY_V << LCDCAM_LCD_DUMMY_S)
#define LCDCAM_LCD_DUMMY_V  0x00000001U
#define LCDCAM_LCD_DUMMY_S  25
/** LCDCAM_LCD_CMD : R/W; bitpos: [26]; default: 0;
 *  1: Be able to send command in LCD sequence when LCD starts. 0: Disable.
 */
#define LCDCAM_LCD_CMD    (BIT(26))
#define LCDCAM_LCD_CMD_M  (LCDCAM_LCD_CMD_V << LCDCAM_LCD_CMD_S)
#define LCDCAM_LCD_CMD_V  0x00000001U
#define LCDCAM_LCD_CMD_S  26
/** LCDCAM_LCD_START : R/W/SC; bitpos: [27]; default: 0;
 *  LCD start sending data enable signal, valid in high level.
 */
#define LCDCAM_LCD_START    (BIT(27))
#define LCDCAM_LCD_START_M  (LCDCAM_LCD_START_V << LCDCAM_LCD_START_S)
#define LCDCAM_LCD_START_V  0x00000001U
#define LCDCAM_LCD_START_S  27
/** LCDCAM_LCD_RESET : WT; bitpos: [28]; default: 0;
 *  The value of  command.
 */
#define LCDCAM_LCD_RESET    (BIT(28))
#define LCDCAM_LCD_RESET_M  (LCDCAM_LCD_RESET_V << LCDCAM_LCD_RESET_S)
#define LCDCAM_LCD_RESET_V  0x00000001U
#define LCDCAM_LCD_RESET_S  28
/** LCDCAM_LCD_DUMMY_CYCLELEN : R/W; bitpos: [30:29]; default: 0;
 *  The dummy cycle length minus 1.
 */
#define LCDCAM_LCD_DUMMY_CYCLELEN    0x00000003U
#define LCDCAM_LCD_DUMMY_CYCLELEN_M  (LCDCAM_LCD_DUMMY_CYCLELEN_V << LCDCAM_LCD_DUMMY_CYCLELEN_S)
#define LCDCAM_LCD_DUMMY_CYCLELEN_V  0x00000003U
#define LCDCAM_LCD_DUMMY_CYCLELEN_S  29
/** LCDCAM_LCD_CMD_2_CYCLE_EN : R/W; bitpos: [31]; default: 0;
 *  The cycle length of command phase. 1: 2 cycles. 0: 1 cycle.
 */
#define LCDCAM_LCD_CMD_2_CYCLE_EN    (BIT(31))
#define LCDCAM_LCD_CMD_2_CYCLE_EN_M  (LCDCAM_LCD_CMD_2_CYCLE_EN_V << LCDCAM_LCD_CMD_2_CYCLE_EN_S)
#define LCDCAM_LCD_CMD_2_CYCLE_EN_V  0x00000001U
#define LCDCAM_LCD_CMD_2_CYCLE_EN_S  31

/** LCDCAM_LCD_MISC_REG register
 *  LCD config register.
 */
#define LCDCAM_LCD_MISC_REG (DR_REG_LCDCAM_BASE + 0x18)
/** LCDCAM_LCD_RGB_MODE_EN : R/W; bitpos: [3]; default: 0;
 *  1: Enable LCD RGB mode. 0: Disable LCD RGB mode.
 */
#define LCDCAM_LCD_RGB_MODE_EN    (BIT(3))
#define LCDCAM_LCD_RGB_MODE_EN_M  (LCDCAM_LCD_RGB_MODE_EN_V << LCDCAM_LCD_RGB_MODE_EN_S)
#define LCDCAM_LCD_RGB_MODE_EN_V  0x00000001U
#define LCDCAM_LCD_RGB_MODE_EN_S  3
/** LCDCAM_LCD_WIRE_MODE : R/W; bitpos: [5:4]; default: 0;
 *  The wire width of LCD output. 0: 8bit. 1: 16bit 2: 24bit
 */
#define LCDCAM_LCD_WIRE_MODE    0x00000003U
#define LCDCAM_LCD_WIRE_MODE_M  (LCDCAM_LCD_WIRE_MODE_V << LCDCAM_LCD_WIRE_MODE_S)
#define LCDCAM_LCD_WIRE_MODE_V  0x00000003U
#define LCDCAM_LCD_WIRE_MODE_S  4
/** LCDCAM_LCD_VFK_CYCLELEN : R/W; bitpos: [11:6]; default: 3;
 *  The setup cycle length minus 1 in LCD non-RGB mode.
 */
#define LCDCAM_LCD_VFK_CYCLELEN    0x0000003FU
#define LCDCAM_LCD_VFK_CYCLELEN_M  (LCDCAM_LCD_VFK_CYCLELEN_V << LCDCAM_LCD_VFK_CYCLELEN_S)
#define LCDCAM_LCD_VFK_CYCLELEN_V  0x0000003FU
#define LCDCAM_LCD_VFK_CYCLELEN_S  6
/** LCDCAM_LCD_VBK_CYCLELEN : R/W; bitpos: [24:12]; default: 0;
 *  The vertical back blank region cycle length minus 1 in LCD RGB mode, or the hold
 *  time cycle length in LCD non-RGB mode.
 */
#define LCDCAM_LCD_VBK_CYCLELEN    0x00001FFFU
#define LCDCAM_LCD_VBK_CYCLELEN_M  (LCDCAM_LCD_VBK_CYCLELEN_V << LCDCAM_LCD_VBK_CYCLELEN_S)
#define LCDCAM_LCD_VBK_CYCLELEN_V  0x00001FFFU
#define LCDCAM_LCD_VBK_CYCLELEN_S  12
/** LCDCAM_LCD_NEXT_FRAME_EN : R/W; bitpos: [25]; default: 0;
 *  1: Send the next frame data when the current frame is sent out. 0: LCD stops when
 *  the current frame is sent out.
 */
#define LCDCAM_LCD_NEXT_FRAME_EN    (BIT(25))
#define LCDCAM_LCD_NEXT_FRAME_EN_M  (LCDCAM_LCD_NEXT_FRAME_EN_V << LCDCAM_LCD_NEXT_FRAME_EN_S)
#define LCDCAM_LCD_NEXT_FRAME_EN_V  0x00000001U
#define LCDCAM_LCD_NEXT_FRAME_EN_S  25
/** LCDCAM_LCD_BK_EN : R/W; bitpos: [26]; default: 0;
 *  1: Enable blank region when LCD sends data out. 0: No blank region.
 */
#define LCDCAM_LCD_BK_EN    (BIT(26))
#define LCDCAM_LCD_BK_EN_M  (LCDCAM_LCD_BK_EN_V << LCDCAM_LCD_BK_EN_S)
#define LCDCAM_LCD_BK_EN_V  0x00000001U
#define LCDCAM_LCD_BK_EN_S  26
/** LCDCAM_LCD_AFIFO_RESET : WT; bitpos: [27]; default: 0;
 *  LCD AFIFO reset signal.
 */
#define LCDCAM_LCD_AFIFO_RESET    (BIT(27))
#define LCDCAM_LCD_AFIFO_RESET_M  (LCDCAM_LCD_AFIFO_RESET_V << LCDCAM_LCD_AFIFO_RESET_S)
#define LCDCAM_LCD_AFIFO_RESET_V  0x00000001U
#define LCDCAM_LCD_AFIFO_RESET_S  27
/** LCDCAM_LCD_CD_DATA_SET : R/W; bitpos: [28]; default: 0;
 *  1: LCD_CD = !reg_cd_idle_edge when lcd_st[2:0] is in LCD_DOUT state.  0: LCD_CD =
 *  reg_cd_idle_edge.
 */
#define LCDCAM_LCD_CD_DATA_SET    (BIT(28))
#define LCDCAM_LCD_CD_DATA_SET_M  (LCDCAM_LCD_CD_DATA_SET_V << LCDCAM_LCD_CD_DATA_SET_S)
#define LCDCAM_LCD_CD_DATA_SET_V  0x00000001U
#define LCDCAM_LCD_CD_DATA_SET_S  28
/** LCDCAM_LCD_CD_DUMMY_SET : R/W; bitpos: [29]; default: 0;
 *  1: LCD_CD = !reg_cd_idle_edge when lcd_st[2:0] is in LCD_DUMMY state.  0: LCD_CD =
 *  reg_cd_idle_edge.
 */
#define LCDCAM_LCD_CD_DUMMY_SET    (BIT(29))
#define LCDCAM_LCD_CD_DUMMY_SET_M  (LCDCAM_LCD_CD_DUMMY_SET_V << LCDCAM_LCD_CD_DUMMY_SET_S)
#define LCDCAM_LCD_CD_DUMMY_SET_V  0x00000001U
#define LCDCAM_LCD_CD_DUMMY_SET_S  29
/** LCDCAM_LCD_CD_CMD_SET : R/W; bitpos: [30]; default: 0;
 *  1: LCD_CD = !reg_cd_idle_edge when lcd_st[2:0] is in LCD_CMD state.  0: LCD_CD =
 *  reg_cd_idle_edge.
 */
#define LCDCAM_LCD_CD_CMD_SET    (BIT(30))
#define LCDCAM_LCD_CD_CMD_SET_M  (LCDCAM_LCD_CD_CMD_SET_V << LCDCAM_LCD_CD_CMD_SET_S)
#define LCDCAM_LCD_CD_CMD_SET_V  0x00000001U
#define LCDCAM_LCD_CD_CMD_SET_S  30
/** LCDCAM_LCD_CD_IDLE_EDGE : R/W; bitpos: [31]; default: 0;
 *  The default value of LCD_CD.
 */
#define LCDCAM_LCD_CD_IDLE_EDGE    (BIT(31))
#define LCDCAM_LCD_CD_IDLE_EDGE_M  (LCDCAM_LCD_CD_IDLE_EDGE_V << LCDCAM_LCD_CD_IDLE_EDGE_S)
#define LCDCAM_LCD_CD_IDLE_EDGE_V  0x00000001U
#define LCDCAM_LCD_CD_IDLE_EDGE_S  31

/** LCDCAM_LCD_RGB_VERTICAL_REG register
 *  LCD config register.
 */
#define LCDCAM_LCD_RGB_VERTICAL_REG (DR_REG_LCDCAM_BASE + 0x1c)
/** LCDCAM_LCD_VA_HEIGHT : R/W; bitpos: [15:0]; default: 0;
 *  It is the vertical active height of a frame.
 */
#define LCDCAM_LCD_VA_HEIGHT    0x0000FFFFU
#define LCDCAM_LCD_VA_HEIGHT_M  (LCDCAM_LCD_VA_HEIGHT_V << LCDCAM_LCD_VA_HEIGHT_S)
#define LCDCAM_LCD_VA_HEIGHT_V  0x0000FFFFU
#define LCDCAM_LCD_VA_HEIGHT_S  0
/** LCDCAM_LCD_VT_HEIGHT : R/W; bitpos: [31:16]; default: 0;
 *  It is the vertical total height of a frame.
 */
#define LCDCAM_LCD_VT_HEIGHT    0x0000FFFFU
#define LCDCAM_LCD_VT_HEIGHT_M  (LCDCAM_LCD_VT_HEIGHT_V << LCDCAM_LCD_VT_HEIGHT_S)
#define LCDCAM_LCD_VT_HEIGHT_V  0x0000FFFFU
#define LCDCAM_LCD_VT_HEIGHT_S  16

/** LCDCAM_LCD_RGB_HORIZONTAL_REG register
 *  LCD config register.
 */
#define LCDCAM_LCD_RGB_HORIZONTAL_REG (DR_REG_LCDCAM_BASE + 0x20)
/** LCDCAM_LCD_HA_WIDTH : R/W; bitpos: [15:0]; default: 0;
 *  It is the horizontal active width of a frame.
 */
#define LCDCAM_LCD_HA_WIDTH    0x0000FFFFU
#define LCDCAM_LCD_HA_WIDTH_M  (LCDCAM_LCD_HA_WIDTH_V << LCDCAM_LCD_HA_WIDTH_S)
#define LCDCAM_LCD_HA_WIDTH_V  0x0000FFFFU
#define LCDCAM_LCD_HA_WIDTH_S  0
/** LCDCAM_LCD_HT_WIDTH : R/W; bitpos: [31:16]; default: 0;
 *  It is the horizontal total width of a frame.
 */
#define LCDCAM_LCD_HT_WIDTH    0x0000FFFFU
#define LCDCAM_LCD_HT_WIDTH_M  (LCDCAM_LCD_HT_WIDTH_V << LCDCAM_LCD_HT_WIDTH_S)
#define LCDCAM_LCD_HT_WIDTH_V  0x0000FFFFU
#define LCDCAM_LCD_HT_WIDTH_S  16

/** LCDCAM_LCD_RGB_BLANK_REG register
 *  LCD config register.
 */
#define LCDCAM_LCD_RGB_BLANK_REG (DR_REG_LCDCAM_BASE + 0x24)
/** LCDCAM_LCD_HB_FRONT : R/W; bitpos: [15:0]; default: 0;
 *  It is the horizontal blank front porch of a frame.
 */
#define LCDCAM_LCD_HB_FRONT    0x0000FFFFU
#define LCDCAM_LCD_HB_FRONT_M  (LCDCAM_LCD_HB_FRONT_V << LCDCAM_LCD_HB_FRONT_S)
#define LCDCAM_LCD_HB_FRONT_V  0x0000FFFFU
#define LCDCAM_LCD_HB_FRONT_S  0
/** LCDCAM_LCD_VB_FRONT : R/W; bitpos: [31:16]; default: 0;
 *  It is the vertical blank front porch of a frame.
 */
#define LCDCAM_LCD_VB_FRONT    0x0000FFFFU
#define LCDCAM_LCD_VB_FRONT_M  (LCDCAM_LCD_VB_FRONT_V << LCDCAM_LCD_VB_FRONT_S)
#define LCDCAM_LCD_VB_FRONT_V  0x0000FFFFU
#define LCDCAM_LCD_VB_FRONT_S  16

/** LCDCAM_LCD_RGB_CTRL_REG register
 *  LCD config register.
 */
#define LCDCAM_LCD_RGB_CTRL_REG (DR_REG_LCDCAM_BASE + 0x28)
/** LCDCAM_LCD_VSYNC_WIDTH : R/W; bitpos: [9:0]; default: 1;
 *  It is the position of LCD_VSYNC active pulse in a line.
 */
#define LCDCAM_LCD_VSYNC_WIDTH    0x000003FFU
#define LCDCAM_LCD_VSYNC_WIDTH_M  (LCDCAM_LCD_VSYNC_WIDTH_V << LCDCAM_LCD_VSYNC_WIDTH_S)
#define LCDCAM_LCD_VSYNC_WIDTH_V  0x000003FFU
#define LCDCAM_LCD_VSYNC_WIDTH_S  0
/** LCDCAM_LCD_VSYNC_IDLE_POL : R/W; bitpos: [10]; default: 0;
 *  It is the idle value of LCD_VSYNC.
 */
#define LCDCAM_LCD_VSYNC_IDLE_POL    (BIT(10))
#define LCDCAM_LCD_VSYNC_IDLE_POL_M  (LCDCAM_LCD_VSYNC_IDLE_POL_V << LCDCAM_LCD_VSYNC_IDLE_POL_S)
#define LCDCAM_LCD_VSYNC_IDLE_POL_V  0x00000001U
#define LCDCAM_LCD_VSYNC_IDLE_POL_S  10
/** LCDCAM_LCD_DE_IDLE_POL : R/W; bitpos: [11]; default: 0;
 *  It is the idle value of LCD_DE.
 */
#define LCDCAM_LCD_DE_IDLE_POL    (BIT(11))
#define LCDCAM_LCD_DE_IDLE_POL_M  (LCDCAM_LCD_DE_IDLE_POL_V << LCDCAM_LCD_DE_IDLE_POL_S)
#define LCDCAM_LCD_DE_IDLE_POL_V  0x00000001U
#define LCDCAM_LCD_DE_IDLE_POL_S  11
/** LCDCAM_LCD_HS_BLANK_EN : R/W; bitpos: [12]; default: 0;
 *  1: The pulse of LCD_HSYNC is out in vertical blanking lines RGB mode. 0: LCD_HSYNC
 *  pulse is valid only in active region lines in RGB mode.
 */
#define LCDCAM_LCD_HS_BLANK_EN    (BIT(12))
#define LCDCAM_LCD_HS_BLANK_EN_M  (LCDCAM_LCD_HS_BLANK_EN_V << LCDCAM_LCD_HS_BLANK_EN_S)
#define LCDCAM_LCD_HS_BLANK_EN_V  0x00000001U
#define LCDCAM_LCD_HS_BLANK_EN_S  12
/** LCDCAM_LCD_HSYNC_WIDTH : R/W; bitpos: [22:16]; default: 1;
 *  It is the position of LCD_HSYNC active pulse in a line.
 */
#define LCDCAM_LCD_HSYNC_WIDTH    0x0000007FU
#define LCDCAM_LCD_HSYNC_WIDTH_M  (LCDCAM_LCD_HSYNC_WIDTH_V << LCDCAM_LCD_HSYNC_WIDTH_S)
#define LCDCAM_LCD_HSYNC_WIDTH_V  0x0000007FU
#define LCDCAM_LCD_HSYNC_WIDTH_S  16
/** LCDCAM_LCD_HSYNC_IDLE_POL : R/W; bitpos: [23]; default: 0;
 *  It is the idle value of LCD_HSYNC.
 */
#define LCDCAM_LCD_HSYNC_IDLE_POL    (BIT(23))
#define LCDCAM_LCD_HSYNC_IDLE_POL_M  (LCDCAM_LCD_HSYNC_IDLE_POL_V << LCDCAM_LCD_HSYNC_IDLE_POL_S)
#define LCDCAM_LCD_HSYNC_IDLE_POL_V  0x00000001U
#define LCDCAM_LCD_HSYNC_IDLE_POL_S  23
/** LCDCAM_LCD_HSYNC_POSITION : R/W; bitpos: [31:24]; default: 0;
 *  It is the position of LCD_HSYNC active pulse in a line.
 */
#define LCDCAM_LCD_HSYNC_POSITION    0x000000FFU
#define LCDCAM_LCD_HSYNC_POSITION_M  (LCDCAM_LCD_HSYNC_POSITION_V << LCDCAM_LCD_HSYNC_POSITION_S)
#define LCDCAM_LCD_HSYNC_POSITION_V  0x000000FFU
#define LCDCAM_LCD_HSYNC_POSITION_S  24

/** LCDCAM_LCD_FIRST_CMD_VAL_REG register
 *  LCD config register.
 */
#define LCDCAM_LCD_FIRST_CMD_VAL_REG (DR_REG_LCDCAM_BASE + 0x2c)
/** LCDCAM_LCD_FIRST_CMD_VALUE : R/W; bitpos: [31:0]; default: 0;
 *  The LCD write command value of first cmd cycle.
 */
#define LCDCAM_LCD_FIRST_CMD_VALUE    0xFFFFFFFFU
#define LCDCAM_LCD_FIRST_CMD_VALUE_M  (LCDCAM_LCD_FIRST_CMD_VALUE_V << LCDCAM_LCD_FIRST_CMD_VALUE_S)
#define LCDCAM_LCD_FIRST_CMD_VALUE_V  0xFFFFFFFFU
#define LCDCAM_LCD_FIRST_CMD_VALUE_S  0

/** LCDCAM_LCD_LATTER_CMD_VAL_REG register
 *  LCD config register.
 */
#define LCDCAM_LCD_LATTER_CMD_VAL_REG (DR_REG_LCDCAM_BASE + 0x30)
/** LCDCAM_LCD_LATTER_CMD_VALUE : R/W; bitpos: [31:0]; default: 0;
 *  The LCD write command value of latter cmd cycle.
 */
#define LCDCAM_LCD_LATTER_CMD_VALUE    0xFFFFFFFFU
#define LCDCAM_LCD_LATTER_CMD_VALUE_M  (LCDCAM_LCD_LATTER_CMD_VALUE_V << LCDCAM_LCD_LATTER_CMD_VALUE_S)
#define LCDCAM_LCD_LATTER_CMD_VALUE_V  0xFFFFFFFFU
#define LCDCAM_LCD_LATTER_CMD_VALUE_S  0

/** LCDCAM_LCD_DLY_MODE_CFG1_REG register
 *  LCD config register.
 */
#define LCDCAM_LCD_DLY_MODE_CFG1_REG (DR_REG_LCDCAM_BASE + 0x34)
/** LCDCAM_DOUT16_MODE : R/W; bitpos: [1:0]; default: 0;
 *  The output data bit $n is delayed by module clock LCD_CLK. 0: output without
 *  delayed. 1: delay by the positive edge of LCD_CLK. 2: delay by the negative edge of
 *  LCD_CLK.
 */
#define LCDCAM_DOUT16_MODE    0x00000003U
#define LCDCAM_DOUT16_MODE_M  (LCDCAM_DOUT16_MODE_V << LCDCAM_DOUT16_MODE_S)
#define LCDCAM_DOUT16_MODE_V  0x00000003U
#define LCDCAM_DOUT16_MODE_S  0
/** LCDCAM_DOUT17_MODE : R/W; bitpos: [3:2]; default: 0;
 *  The output data bit $n is delayed by module clock LCD_CLK. 0: output without
 *  delayed. 1: delay by the positive edge of LCD_CLK. 2: delay by the negative edge of
 *  LCD_CLK.
 */
#define LCDCAM_DOUT17_MODE    0x00000003U
#define LCDCAM_DOUT17_MODE_M  (LCDCAM_DOUT17_MODE_V << LCDCAM_DOUT17_MODE_S)
#define LCDCAM_DOUT17_MODE_V  0x00000003U
#define LCDCAM_DOUT17_MODE_S  2
/** LCDCAM_DOUT18_MODE : R/W; bitpos: [5:4]; default: 0;
 *  The output data bit $n is delayed by module clock LCD_CLK. 0: output without
 *  delayed. 1: delay by the positive edge of LCD_CLK. 2: delay by the negative edge of
 *  LCD_CLK.
 */
#define LCDCAM_DOUT18_MODE    0x00000003U
#define LCDCAM_DOUT18_MODE_M  (LCDCAM_DOUT18_MODE_V << LCDCAM_DOUT18_MODE_S)
#define LCDCAM_DOUT18_MODE_V  0x00000003U
#define LCDCAM_DOUT18_MODE_S  4
/** LCDCAM_DOUT19_MODE : R/W; bitpos: [7:6]; default: 0;
 *  The output data bit $n is delayed by module clock LCD_CLK. 0: output without
 *  delayed. 1: delay by the positive edge of LCD_CLK. 2: delay by the negative edge of
 *  LCD_CLK.
 */
#define LCDCAM_DOUT19_MODE    0x00000003U
#define LCDCAM_DOUT19_MODE_M  (LCDCAM_DOUT19_MODE_V << LCDCAM_DOUT19_MODE_S)
#define LCDCAM_DOUT19_MODE_V  0x00000003U
#define LCDCAM_DOUT19_MODE_S  6
/** LCDCAM_DOUT20_MODE : R/W; bitpos: [9:8]; default: 0;
 *  The output data bit $n is delayed by module clock LCD_CLK. 0: output without
 *  delayed. 1: delay by the positive edge of LCD_CLK. 2: delay by the negative edge of
 *  LCD_CLK.
 */
#define LCDCAM_DOUT20_MODE    0x00000003U
#define LCDCAM_DOUT20_MODE_M  (LCDCAM_DOUT20_MODE_V << LCDCAM_DOUT20_MODE_S)
#define LCDCAM_DOUT20_MODE_V  0x00000003U
#define LCDCAM_DOUT20_MODE_S  8
/** LCDCAM_DOUT21_MODE : R/W; bitpos: [11:10]; default: 0;
 *  The output data bit $n is delayed by module clock LCD_CLK. 0: output without
 *  delayed. 1: delay by the positive edge of LCD_CLK. 2: delay by the negative edge of
 *  LCD_CLK.
 */
#define LCDCAM_DOUT21_MODE    0x00000003U
#define LCDCAM_DOUT21_MODE_M  (LCDCAM_DOUT21_MODE_V << LCDCAM_DOUT21_MODE_S)
#define LCDCAM_DOUT21_MODE_V  0x00000003U
#define LCDCAM_DOUT21_MODE_S  10
/** LCDCAM_DOUT22_MODE : R/W; bitpos: [13:12]; default: 0;
 *  The output data bit $n is delayed by module clock LCD_CLK. 0: output without
 *  delayed. 1: delay by the positive edge of LCD_CLK. 2: delay by the negative edge of
 *  LCD_CLK.
 */
#define LCDCAM_DOUT22_MODE    0x00000003U
#define LCDCAM_DOUT22_MODE_M  (LCDCAM_DOUT22_MODE_V << LCDCAM_DOUT22_MODE_S)
#define LCDCAM_DOUT22_MODE_V  0x00000003U
#define LCDCAM_DOUT22_MODE_S  12
/** LCDCAM_DOUT23_MODE : R/W; bitpos: [15:14]; default: 0;
 *  The output data bit $n is delayed by module clock LCD_CLK. 0: output without
 *  delayed. 1: delay by the positive edge of LCD_CLK. 2: delay by the negative edge of
 *  LCD_CLK.
 */
#define LCDCAM_DOUT23_MODE    0x00000003U
#define LCDCAM_DOUT23_MODE_M  (LCDCAM_DOUT23_MODE_V << LCDCAM_DOUT23_MODE_S)
#define LCDCAM_DOUT23_MODE_V  0x00000003U
#define LCDCAM_DOUT23_MODE_S  14
/** LCDCAM_LCD_CD_MODE : R/W; bitpos: [17:16]; default: 0;
 *  The output LCD_CD is delayed by module clock LCD_CLK. 0: output without delayed. 1:
 *  delay by the positive edge of LCD_CLK. 2: delay by the negative edge of LCD_CLK.
 */
#define LCDCAM_LCD_CD_MODE    0x00000003U
#define LCDCAM_LCD_CD_MODE_M  (LCDCAM_LCD_CD_MODE_V << LCDCAM_LCD_CD_MODE_S)
#define LCDCAM_LCD_CD_MODE_V  0x00000003U
#define LCDCAM_LCD_CD_MODE_S  16
/** LCDCAM_LCD_DE_MODE : R/W; bitpos: [19:18]; default: 0;
 *  The output LCD_DE is delayed by module clock LCD_CLK. 0: output without delayed. 1:
 *  delay by the positive edge of LCD_CLK. 2: delay by the negative edge of LCD_CLK.
 */
#define LCDCAM_LCD_DE_MODE    0x00000003U
#define LCDCAM_LCD_DE_MODE_M  (LCDCAM_LCD_DE_MODE_V << LCDCAM_LCD_DE_MODE_S)
#define LCDCAM_LCD_DE_MODE_V  0x00000003U
#define LCDCAM_LCD_DE_MODE_S  18
/** LCDCAM_LCD_HSYNC_MODE : R/W; bitpos: [21:20]; default: 0;
 *  The output LCD_HSYNC is delayed by module clock LCD_CLK. 0: output without delayed.
 *  1: delay by the positive edge of LCD_CLK. 2: delay by the negative edge of LCD_CLK.
 */
#define LCDCAM_LCD_HSYNC_MODE    0x00000003U
#define LCDCAM_LCD_HSYNC_MODE_M  (LCDCAM_LCD_HSYNC_MODE_V << LCDCAM_LCD_HSYNC_MODE_S)
#define LCDCAM_LCD_HSYNC_MODE_V  0x00000003U
#define LCDCAM_LCD_HSYNC_MODE_S  20
/** LCDCAM_LCD_VSYNC_MODE : R/W; bitpos: [23:22]; default: 0;
 *  The output LCD_VSYNC is delayed by module clock LCD_CLK. 0: output without delayed.
 *  1: delay by the positive edge of LCD_CLK. 2: delay by the negative edge of LCD_CLK.
 */
#define LCDCAM_LCD_VSYNC_MODE    0x00000003U
#define LCDCAM_LCD_VSYNC_MODE_M  (LCDCAM_LCD_VSYNC_MODE_V << LCDCAM_LCD_VSYNC_MODE_S)
#define LCDCAM_LCD_VSYNC_MODE_V  0x00000003U
#define LCDCAM_LCD_VSYNC_MODE_S  22

