espressif/esp-idf/components/soc/esp32s31/register/soc/lcd_cam_reg.h
/** LCDCAM_LCD_DLY_MODE_CFG2_REG register
 *  LCD config register.
 */
#define LCDCAM_LCD_DLY_MODE_CFG2_REG (DR_REG_LCDCAM_BASE + 0x38)
/** LCDCAM_DOUT0_MODE : R/W; bitpos: [1:0]; default: 0;
 *  The output data bit $n is delayed by module clock LCD_CLK. 0: output without
 *  delayed. 1: delay by the positive edge of LCD_CLK. 2: delay by the negative edge of
 *  LCD_CLK.
 */
#define LCDCAM_DOUT0_MODE    0x00000003U
#define LCDCAM_DOUT0_MODE_M  (LCDCAM_DOUT0_MODE_V << LCDCAM_DOUT0_MODE_S)
#define LCDCAM_DOUT0_MODE_V  0x00000003U
#define LCDCAM_DOUT0_MODE_S  0
/** LCDCAM_DOUT1_MODE : R/W; bitpos: [3:2]; default: 0;
 *  The output data bit $n is delayed by module clock LCD_CLK. 0: output without
 *  delayed. 1: delay by the positive edge of LCD_CLK. 2: delay by the negative edge of
 *  LCD_CLK.
 */
#define LCDCAM_DOUT1_MODE    0x00000003U
#define LCDCAM_DOUT1_MODE_M  (LCDCAM_DOUT1_MODE_V << LCDCAM_DOUT1_MODE_S)
#define LCDCAM_DOUT1_MODE_V  0x00000003U
#define LCDCAM_DOUT1_MODE_S  2
/** LCDCAM_DOUT2_MODE : R/W; bitpos: [5:4]; default: 0;
 *  The output data bit $n is delayed by module clock LCD_CLK. 0: output without
 *  delayed. 1: delay by the positive edge of LCD_CLK. 2: delay by the negative edge of
 *  LCD_CLK.
 */
#define LCDCAM_DOUT2_MODE    0x00000003U
#define LCDCAM_DOUT2_MODE_M  (LCDCAM_DOUT2_MODE_V << LCDCAM_DOUT2_MODE_S)
#define LCDCAM_DOUT2_MODE_V  0x00000003U
#define LCDCAM_DOUT2_MODE_S  4
/** LCDCAM_DOUT3_MODE : R/W; bitpos: [7:6]; default: 0;
 *  The output data bit $n is delayed by module clock LCD_CLK. 0: output without
 *  delayed. 1: delay by the positive edge of LCD_CLK. 2: delay by the negative edge of
 *  LCD_CLK.
 */
#define LCDCAM_DOUT3_MODE    0x00000003U
#define LCDCAM_DOUT3_MODE_M  (LCDCAM_DOUT3_MODE_V << LCDCAM_DOUT3_MODE_S)
#define LCDCAM_DOUT3_MODE_V  0x00000003U
#define LCDCAM_DOUT3_MODE_S  6
/** LCDCAM_DOUT4_MODE : R/W; bitpos: [9:8]; default: 0;
 *  The output data bit $n is delayed by module clock LCD_CLK. 0: output without
 *  delayed. 1: delay by the positive edge of LCD_CLK. 2: delay by the negative edge of
 *  LCD_CLK.
 */
#define LCDCAM_DOUT4_MODE    0x00000003U
#define LCDCAM_DOUT4_MODE_M  (LCDCAM_DOUT4_MODE_V << LCDCAM_DOUT4_MODE_S)
#define LCDCAM_DOUT4_MODE_V  0x00000003U
#define LCDCAM_DOUT4_MODE_S  8
/** LCDCAM_DOUT5_MODE : R/W; bitpos: [11:10]; default: 0;
 *  The output data bit $n is delayed by module clock LCD_CLK. 0: output without
 *  delayed. 1: delay by the positive edge of LCD_CLK. 2: delay by the negative edge of
 *  LCD_CLK.
 */
#define LCDCAM_DOUT5_MODE    0x00000003U
#define LCDCAM_DOUT5_MODE_M  (LCDCAM_DOUT5_MODE_V << LCDCAM_DOUT5_MODE_S)
#define LCDCAM_DOUT5_MODE_V  0x00000003U
#define LCDCAM_DOUT5_MODE_S  10
/** LCDCAM_DOUT6_MODE : R/W; bitpos: [13:12]; default: 0;
 *  The output data bit $n is delayed by module clock LCD_CLK. 0: output without
 *  delayed. 1: delay by the positive edge of LCD_CLK. 2: delay by the negative edge of
 *  LCD_CLK.
 */
#define LCDCAM_DOUT6_MODE    0x00000003U
#define LCDCAM_DOUT6_MODE_M  (LCDCAM_DOUT6_MODE_V << LCDCAM_DOUT6_MODE_S)
#define LCDCAM_DOUT6_MODE_V  0x00000003U
#define LCDCAM_DOUT6_MODE_S  12
/** LCDCAM_DOUT7_MODE : R/W; bitpos: [15:14]; default: 0;
 *  The output data bit $n is delayed by module clock LCD_CLK. 0: output without
 *  delayed. 1: delay by the positive edge of LCD_CLK. 2: delay by the negative edge of
 *  LCD_CLK.
 */
#define LCDCAM_DOUT7_MODE    0x00000003U
#define LCDCAM_DOUT7_MODE_M  (LCDCAM_DOUT7_MODE_V << LCDCAM_DOUT7_MODE_S)
#define LCDCAM_DOUT7_MODE_V  0x00000003U
#define LCDCAM_DOUT7_MODE_S  14
/** LCDCAM_DOUT8_MODE : R/W; bitpos: [17:16]; default: 0;
 *  The output data bit $n is delayed by module clock LCD_CLK. 0: output without
 *  delayed. 1: delay by the positive edge of LCD_CLK. 2: delay by the negative edge of
 *  LCD_CLK.
 */
#define LCDCAM_DOUT8_MODE    0x00000003U
#define LCDCAM_DOUT8_MODE_M  (LCDCAM_DOUT8_MODE_V << LCDCAM_DOUT8_MODE_S)
#define LCDCAM_DOUT8_MODE_V  0x00000003U
#define LCDCAM_DOUT8_MODE_S  16
/** LCDCAM_DOUT9_MODE : R/W; bitpos: [19:18]; default: 0;
 *  The output data bit $n is delayed by module clock LCD_CLK. 0: output without
 *  delayed. 1: delay by the positive edge of LCD_CLK. 2: delay by the negative edge of
 *  LCD_CLK.
 */
#define LCDCAM_DOUT9_MODE    0x00000003U
#define LCDCAM_DOUT9_MODE_M  (LCDCAM_DOUT9_MODE_V << LCDCAM_DOUT9_MODE_S)
#define LCDCAM_DOUT9_MODE_V  0x00000003U
#define LCDCAM_DOUT9_MODE_S  18
/** LCDCAM_DOUT10_MODE : R/W; bitpos: [21:20]; default: 0;
 *  The output data bit $n is delayed by module clock LCD_CLK. 0: output without
 *  delayed. 1: delay by the positive edge of LCD_CLK. 2: delay by the negative edge of
 *  LCD_CLK.
 */
#define LCDCAM_DOUT10_MODE    0x00000003U
#define LCDCAM_DOUT10_MODE_M  (LCDCAM_DOUT10_MODE_V << LCDCAM_DOUT10_MODE_S)
#define LCDCAM_DOUT10_MODE_V  0x00000003U
#define LCDCAM_DOUT10_MODE_S  20
/** LCDCAM_DOUT11_MODE : R/W; bitpos: [23:22]; default: 0;
 *  The output data bit $n is delayed by module clock LCD_CLK. 0: output without
 *  delayed. 1: delay by the positive edge of LCD_CLK. 2: delay by the negative edge of
 *  LCD_CLK.
 */
#define LCDCAM_DOUT11_MODE    0x00000003U
#define LCDCAM_DOUT11_MODE_M  (LCDCAM_DOUT11_MODE_V << LCDCAM_DOUT11_MODE_S)
#define LCDCAM_DOUT11_MODE_V  0x00000003U
#define LCDCAM_DOUT11_MODE_S  22
/** LCDCAM_DOUT12_MODE : R/W; bitpos: [25:24]; default: 0;
 *  The output data bit $n is delayed by module clock LCD_CLK. 0: output without
 *  delayed. 1: delay by the positive edge of LCD_CLK. 2: delay by the negative edge of
 *  LCD_CLK.
 */
#define LCDCAM_DOUT12_MODE    0x00000003U
#define LCDCAM_DOUT12_MODE_M  (LCDCAM_DOUT12_MODE_V << LCDCAM_DOUT12_MODE_S)
#define LCDCAM_DOUT12_MODE_V  0x00000003U
#define LCDCAM_DOUT12_MODE_S  24
/** LCDCAM_DOUT13_MODE : R/W; bitpos: [27:26]; default: 0;
 *  The output data bit $n is delayed by module clock LCD_CLK. 0: output without
 *  delayed. 1: delay by the positive edge of LCD_CLK. 2: delay by the negative edge of
 *  LCD_CLK.
 */
#define LCDCAM_DOUT13_MODE    0x00000003U
#define LCDCAM_DOUT13_MODE_M  (LCDCAM_DOUT13_MODE_V << LCDCAM_DOUT13_MODE_S)
#define LCDCAM_DOUT13_MODE_V  0x00000003U
#define LCDCAM_DOUT13_MODE_S  26
/** LCDCAM_DOUT14_MODE : R/W; bitpos: [29:28]; default: 0;
 *  The output data bit $n is delayed by module clock LCD_CLK. 0: output without
 *  delayed. 1: delay by the positive edge of LCD_CLK. 2: delay by the negative edge of
 *  LCD_CLK.
 */
#define LCDCAM_DOUT14_MODE    0x00000003U
#define LCDCAM_DOUT14_MODE_M  (LCDCAM_DOUT14_MODE_V << LCDCAM_DOUT14_MODE_S)
#define LCDCAM_DOUT14_MODE_V  0x00000003U
#define LCDCAM_DOUT14_MODE_S  28
/** LCDCAM_DOUT15_MODE : R/W; bitpos: [31:30]; default: 0;
 *  The output data bit $n is delayed by module clock LCD_CLK. 0: output without
 *  delayed. 1: delay by the positive edge of LCD_CLK. 2: delay by the negative edge of
 *  LCD_CLK.
 */
#define LCDCAM_DOUT15_MODE    0x00000003U
#define LCDCAM_DOUT15_MODE_M  (LCDCAM_DOUT15_MODE_V << LCDCAM_DOUT15_MODE_S)
#define LCDCAM_DOUT15_MODE_V  0x00000003U
#define LCDCAM_DOUT15_MODE_S  30

/** LCDCAM_LCD_TRANS_BUFF_CFG_REG register
 *  LCD trans buffer register
 */
#define LCDCAM_LCD_TRANS_BUFF_CFG_REG (DR_REG_LCDCAM_BASE + 0x3c)
/** LCDCAM_LCD_TRANS_BUFFER_ENA : R/W; bitpos: [0]; default: 0;
 *  1:enable lcd trans buffer.0:not enable lcd trans buffer
 */
#define LCDCAM_LCD_TRANS_BUFFER_ENA    (BIT(0))
#define LCDCAM_LCD_TRANS_BUFFER_ENA_M  (LCDCAM_LCD_TRANS_BUFFER_ENA_V << LCDCAM_LCD_TRANS_BUFFER_ENA_S)
#define LCDCAM_LCD_TRANS_BUFFER_ENA_V  0x00000001U
#define LCDCAM_LCD_TRANS_BUFFER_ENA_S  0

/** LCDCAM_LCD_DATA_DBG_REG register
 *  LCDCAM LCD debug data register
 */
#define LCDCAM_LCD_DATA_DBG_REG (DR_REG_LCDCAM_BASE + 0x40)
/** LCDCAM_LCD_DBG_DATA_RELPACE_ENA : R/W; bitpos: [0]; default: 0;
 *  1:replace the data read from dma.0:not replace the data read from dma
 */
#define LCDCAM_LCD_DBG_DATA_RELPACE_ENA    (BIT(0))
#define LCDCAM_LCD_DBG_DATA_RELPACE_ENA_M  (LCDCAM_LCD_DBG_DATA_RELPACE_ENA_V << LCDCAM_LCD_DBG_DATA_RELPACE_ENA_S)
#define LCDCAM_LCD_DBG_DATA_RELPACE_ENA_V  0x00000001U
#define LCDCAM_LCD_DBG_DATA_RELPACE_ENA_S  0
/** LCDCAM_LCD_DBG_DATA : R/W; bitpos: [24:1]; default: 0;
 *  the debug data that used to replace data read from dma
 */
#define LCDCAM_LCD_DBG_DATA    0x00FFFFFFU
#define LCDCAM_LCD_DBG_DATA_M  (LCDCAM_LCD_DBG_DATA_V << LCDCAM_LCD_DBG_DATA_S)
#define LCDCAM_LCD_DBG_DATA_V  0x00FFFFFFU
#define LCDCAM_LCD_DBG_DATA_S  1

/** LCDCAM_LCD_BW_MONITOR_DBG_REG register
 *  LCDCAM LCD monitor bandwidth debug register
 */
#define LCDCAM_LCD_BW_MONITOR_DBG_REG (DR_REG_LCDCAM_BASE + 0x44)
/** LCDCAM_LCD_BW_MONITORE_ENA : R/W; bitpos: [0]; default: 0;
 *  1:enable lcd monitor bandwidth.0: not enable lcd monitor bandwidth
 */
#define LCDCAM_LCD_BW_MONITORE_ENA    (BIT(0))
#define LCDCAM_LCD_BW_MONITORE_ENA_M  (LCDCAM_LCD_BW_MONITORE_ENA_V << LCDCAM_LCD_BW_MONITORE_ENA_S)
#define LCDCAM_LCD_BW_MONITORE_ENA_V  0x00000001U
#define LCDCAM_LCD_BW_MONITORE_ENA_S  0
/** LCDCAM_LCD_INVALID_RD_NUMBER : RO; bitpos: [31:1]; default: 0;
 *  the statistical data that lcd rd invalid data
 */
#define LCDCAM_LCD_INVALID_RD_NUMBER    0x7FFFFFFFU
#define LCDCAM_LCD_INVALID_RD_NUMBER_M  (LCDCAM_LCD_INVALID_RD_NUMBER_V << LCDCAM_LCD_INVALID_RD_NUMBER_S)
#define LCDCAM_LCD_INVALID_RD_NUMBER_V  0x7FFFFFFFU
#define LCDCAM_LCD_INVALID_RD_NUMBER_S  1

