espressif/esp-idf/components/soc/esp32s31/register/soc/lcd_cam_reg.h
/** LCDCAM_CAM_DATA_DBG_REG register
 *  LCDCAM CAM debug data register
 */
#define LCDCAM_CAM_DATA_DBG_REG (DR_REG_LCDCAM_BASE + 0x48)
/** LCDCAM_CAM_DBG_DATA_RELPACE_ENA : R/W; bitpos: [0]; default: 0;
 *  1:replace the data write to dma.0:not replace the data write to  dma
 */
#define LCDCAM_CAM_DBG_DATA_RELPACE_ENA    (BIT(0))
#define LCDCAM_CAM_DBG_DATA_RELPACE_ENA_M  (LCDCAM_CAM_DBG_DATA_RELPACE_ENA_V << LCDCAM_CAM_DBG_DATA_RELPACE_ENA_S)
#define LCDCAM_CAM_DBG_DATA_RELPACE_ENA_V  0x00000001U
#define LCDCAM_CAM_DBG_DATA_RELPACE_ENA_S  0
/** LCDCAM_CAM_DBG_DATA : R/W; bitpos: [24:1]; default: 0;
 *  the debug data that used to replace data write to dma
 */
#define LCDCAM_CAM_DBG_DATA    0x00FFFFFFU
#define LCDCAM_CAM_DBG_DATA_M  (LCDCAM_CAM_DBG_DATA_V << LCDCAM_CAM_DBG_DATA_S)
#define LCDCAM_CAM_DBG_DATA_V  0x00FFFFFFU
#define LCDCAM_CAM_DBG_DATA_S  1

/** LCDCAM_LC_DMA_INT_ENA_REG register
 *  LCDCAM interrupt enable register.
 */
#define LCDCAM_LC_DMA_INT_ENA_REG (DR_REG_LCDCAM_BASE + 0x64)
/** LCDCAM_LCD_VSYNC_INT_ENA : R/W; bitpos: [0]; default: 0;
 *  The enable bit for LCD frame end interrupt.
 */
#define LCDCAM_LCD_VSYNC_INT_ENA    (BIT(0))
#define LCDCAM_LCD_VSYNC_INT_ENA_M  (LCDCAM_LCD_VSYNC_INT_ENA_V << LCDCAM_LCD_VSYNC_INT_ENA_S)
#define LCDCAM_LCD_VSYNC_INT_ENA_V  0x00000001U
#define LCDCAM_LCD_VSYNC_INT_ENA_S  0
/** LCDCAM_LCD_TRANS_DONE_INT_ENA : R/W; bitpos: [1]; default: 0;
 *  The enable bit for lcd transfer end interrupt.
 */
#define LCDCAM_LCD_TRANS_DONE_INT_ENA    (BIT(1))
#define LCDCAM_LCD_TRANS_DONE_INT_ENA_M  (LCDCAM_LCD_TRANS_DONE_INT_ENA_V << LCDCAM_LCD_TRANS_DONE_INT_ENA_S)
#define LCDCAM_LCD_TRANS_DONE_INT_ENA_V  0x00000001U
#define LCDCAM_LCD_TRANS_DONE_INT_ENA_S  1
/** LCDCAM_CAM_VSYNC_INT_ENA : R/W; bitpos: [2]; default: 0;
 *  The enable bit for Camera frame end interrupt.
 */
#define LCDCAM_CAM_VSYNC_INT_ENA    (BIT(2))
#define LCDCAM_CAM_VSYNC_INT_ENA_M  (LCDCAM_CAM_VSYNC_INT_ENA_V << LCDCAM_CAM_VSYNC_INT_ENA_S)
#define LCDCAM_CAM_VSYNC_INT_ENA_V  0x00000001U
#define LCDCAM_CAM_VSYNC_INT_ENA_S  2
/** LCDCAM_CAM_HS_INT_ENA : R/W; bitpos: [3]; default: 0;
 *  The enable bit for Camera line interrupt.
 */
#define LCDCAM_CAM_HS_INT_ENA    (BIT(3))
#define LCDCAM_CAM_HS_INT_ENA_M  (LCDCAM_CAM_HS_INT_ENA_V << LCDCAM_CAM_HS_INT_ENA_S)
#define LCDCAM_CAM_HS_INT_ENA_V  0x00000001U
#define LCDCAM_CAM_HS_INT_ENA_S  3
/** LCDCAM_LCD_UNDERRUN_INT_ENA : R/W; bitpos: [4]; default: 0;
 *  The enable bit for LCD underrun interrupt
 */
#define LCDCAM_LCD_UNDERRUN_INT_ENA    (BIT(4))
#define LCDCAM_LCD_UNDERRUN_INT_ENA_M  (LCDCAM_LCD_UNDERRUN_INT_ENA_V << LCDCAM_LCD_UNDERRUN_INT_ENA_S)
#define LCDCAM_LCD_UNDERRUN_INT_ENA_V  0x00000001U
#define LCDCAM_LCD_UNDERRUN_INT_ENA_S  4
/** LCDCAM_CAM_OVERFLOW_INT_ENA : R/W; bitpos: [5]; default: 0;
 *  The enable bit for Camera overflow interrupt
 */
#define LCDCAM_CAM_OVERFLOW_INT_ENA    (BIT(5))
#define LCDCAM_CAM_OVERFLOW_INT_ENA_M  (LCDCAM_CAM_OVERFLOW_INT_ENA_V << LCDCAM_CAM_OVERFLOW_INT_ENA_S)
#define LCDCAM_CAM_OVERFLOW_INT_ENA_V  0x00000001U
#define LCDCAM_CAM_OVERFLOW_INT_ENA_S  5

/** LCDCAM_LC_DMA_INT_RAW_REG register
 *  LCDCAM interrupt raw register, valid in level.
 */
#define LCDCAM_LC_DMA_INT_RAW_REG (DR_REG_LCDCAM_BASE + 0x68)
/** LCDCAM_LCD_VSYNC_INT_RAW : RO/WTC/SS; bitpos: [0]; default: 0;
 *  The raw bit for LCD frame end interrupt.
 */
#define LCDCAM_LCD_VSYNC_INT_RAW    (BIT(0))
#define LCDCAM_LCD_VSYNC_INT_RAW_M  (LCDCAM_LCD_VSYNC_INT_RAW_V << LCDCAM_LCD_VSYNC_INT_RAW_S)
#define LCDCAM_LCD_VSYNC_INT_RAW_V  0x00000001U
#define LCDCAM_LCD_VSYNC_INT_RAW_S  0
/** LCDCAM_LCD_TRANS_DONE_INT_RAW : RO/WTC/SS; bitpos: [1]; default: 0;
 *  The raw bit for lcd transfer end interrupt.
 */
#define LCDCAM_LCD_TRANS_DONE_INT_RAW    (BIT(1))
#define LCDCAM_LCD_TRANS_DONE_INT_RAW_M  (LCDCAM_LCD_TRANS_DONE_INT_RAW_V << LCDCAM_LCD_TRANS_DONE_INT_RAW_S)
#define LCDCAM_LCD_TRANS_DONE_INT_RAW_V  0x00000001U
#define LCDCAM_LCD_TRANS_DONE_INT_RAW_S  1
/** LCDCAM_CAM_VSYNC_INT_RAW : RO/WTC/SS; bitpos: [2]; default: 0;
 *  The raw bit for Camera frame end interrupt.
 */
#define LCDCAM_CAM_VSYNC_INT_RAW    (BIT(2))
#define LCDCAM_CAM_VSYNC_INT_RAW_M  (LCDCAM_CAM_VSYNC_INT_RAW_V << LCDCAM_CAM_VSYNC_INT_RAW_S)
#define LCDCAM_CAM_VSYNC_INT_RAW_V  0x00000001U
#define LCDCAM_CAM_VSYNC_INT_RAW_S  2
/** LCDCAM_CAM_HS_INT_RAW : RO/WTC/SS; bitpos: [3]; default: 0;
 *  The raw bit for Camera line interrupt.
 */
#define LCDCAM_CAM_HS_INT_RAW    (BIT(3))
#define LCDCAM_CAM_HS_INT_RAW_M  (LCDCAM_CAM_HS_INT_RAW_V << LCDCAM_CAM_HS_INT_RAW_S)
#define LCDCAM_CAM_HS_INT_RAW_V  0x00000001U
#define LCDCAM_CAM_HS_INT_RAW_S  3
/** LCDCAM_LCD_UNDERRUN_INT_RAW : RO/WTC/SS; bitpos: [4]; default: 0;
 *  The raw bit for LCD underrun interrupt
 */
#define LCDCAM_LCD_UNDERRUN_INT_RAW    (BIT(4))
#define LCDCAM_LCD_UNDERRUN_INT_RAW_M  (LCDCAM_LCD_UNDERRUN_INT_RAW_V << LCDCAM_LCD_UNDERRUN_INT_RAW_S)
#define LCDCAM_LCD_UNDERRUN_INT_RAW_V  0x00000001U
#define LCDCAM_LCD_UNDERRUN_INT_RAW_S  4
/** LCDCAM_CAM_OVERFLOW_INT_RAW : RO/WTC/SS; bitpos: [5]; default: 0;
 *  The raw bit for Camera overflow interrupt
 */
#define LCDCAM_CAM_OVERFLOW_INT_RAW    (BIT(5))
#define LCDCAM_CAM_OVERFLOW_INT_RAW_M  (LCDCAM_CAM_OVERFLOW_INT_RAW_V << LCDCAM_CAM_OVERFLOW_INT_RAW_S)
#define LCDCAM_CAM_OVERFLOW_INT_RAW_V  0x00000001U
#define LCDCAM_CAM_OVERFLOW_INT_RAW_S  5

/** LCDCAM_LC_DMA_INT_ST_REG register
 *  LCDCAM interrupt status register.
 */
#define LCDCAM_LC_DMA_INT_ST_REG (DR_REG_LCDCAM_BASE + 0x6c)
/** LCDCAM_LCD_VSYNC_INT_ST : RO; bitpos: [0]; default: 0;
 *  The status bit for LCD frame end interrupt.
 */
#define LCDCAM_LCD_VSYNC_INT_ST    (BIT(0))
#define LCDCAM_LCD_VSYNC_INT_ST_M  (LCDCAM_LCD_VSYNC_INT_ST_V << LCDCAM_LCD_VSYNC_INT_ST_S)
#define LCDCAM_LCD_VSYNC_INT_ST_V  0x00000001U
#define LCDCAM_LCD_VSYNC_INT_ST_S  0
/** LCDCAM_LCD_TRANS_DONE_INT_ST : RO; bitpos: [1]; default: 0;
 *  The status bit for lcd transfer end interrupt.
 */
#define LCDCAM_LCD_TRANS_DONE_INT_ST    (BIT(1))
#define LCDCAM_LCD_TRANS_DONE_INT_ST_M  (LCDCAM_LCD_TRANS_DONE_INT_ST_V << LCDCAM_LCD_TRANS_DONE_INT_ST_S)
#define LCDCAM_LCD_TRANS_DONE_INT_ST_V  0x00000001U
#define LCDCAM_LCD_TRANS_DONE_INT_ST_S  1
/** LCDCAM_CAM_VSYNC_INT_ST : RO; bitpos: [2]; default: 0;
 *  The status bit for Camera frame end interrupt.
 */
#define LCDCAM_CAM_VSYNC_INT_ST    (BIT(2))
#define LCDCAM_CAM_VSYNC_INT_ST_M  (LCDCAM_CAM_VSYNC_INT_ST_V << LCDCAM_CAM_VSYNC_INT_ST_S)
#define LCDCAM_CAM_VSYNC_INT_ST_V  0x00000001U
#define LCDCAM_CAM_VSYNC_INT_ST_S  2
/** LCDCAM_CAM_HS_INT_ST : RO; bitpos: [3]; default: 0;
 *  The status bit for Camera transfer end interrupt.
 */
#define LCDCAM_CAM_HS_INT_ST    (BIT(3))
#define LCDCAM_CAM_HS_INT_ST_M  (LCDCAM_CAM_HS_INT_ST_V << LCDCAM_CAM_HS_INT_ST_S)
#define LCDCAM_CAM_HS_INT_ST_V  0x00000001U
#define LCDCAM_CAM_HS_INT_ST_S  3
/** LCDCAM_LCD_UNDERRUN_INT_ST : RO; bitpos: [4]; default: 0;
 *  The status bit for LCD underrun interrupt
 */
#define LCDCAM_LCD_UNDERRUN_INT_ST    (BIT(4))
#define LCDCAM_LCD_UNDERRUN_INT_ST_M  (LCDCAM_LCD_UNDERRUN_INT_ST_V << LCDCAM_LCD_UNDERRUN_INT_ST_S)
#define LCDCAM_LCD_UNDERRUN_INT_ST_V  0x00000001U
#define LCDCAM_LCD_UNDERRUN_INT_ST_S  4
/** LCDCAM_CAM_OVERFLOW_INT_ST : RO; bitpos: [5]; default: 0;
 *  The status bit for Camera overflow interrupt
 */
#define LCDCAM_CAM_OVERFLOW_INT_ST    (BIT(5))
#define LCDCAM_CAM_OVERFLOW_INT_ST_M  (LCDCAM_CAM_OVERFLOW_INT_ST_V << LCDCAM_CAM_OVERFLOW_INT_ST_S)
#define LCDCAM_CAM_OVERFLOW_INT_ST_V  0x00000001U
#define LCDCAM_CAM_OVERFLOW_INT_ST_S  5

