espressif/esp-idf/components/soc/esp32s31/register/soc/lcd_cam_reg.h
/** LCDCAM_LC_DMA_INT_CLR_REG register
 *  LCDCAM interrupt clear register.
 */
#define LCDCAM_LC_DMA_INT_CLR_REG (DR_REG_LCDCAM_BASE + 0x70)
/** LCDCAM_LCD_VSYNC_INT_CLR : WT; bitpos: [0]; default: 0;
 *  The clear bit for LCD frame end interrupt.
 */
#define LCDCAM_LCD_VSYNC_INT_CLR    (BIT(0))
#define LCDCAM_LCD_VSYNC_INT_CLR_M  (LCDCAM_LCD_VSYNC_INT_CLR_V << LCDCAM_LCD_VSYNC_INT_CLR_S)
#define LCDCAM_LCD_VSYNC_INT_CLR_V  0x00000001U
#define LCDCAM_LCD_VSYNC_INT_CLR_S  0
/** LCDCAM_LCD_TRANS_DONE_INT_CLR : WT; bitpos: [1]; default: 0;
 *  The clear bit for lcd transfer end interrupt.
 */
#define LCDCAM_LCD_TRANS_DONE_INT_CLR    (BIT(1))
#define LCDCAM_LCD_TRANS_DONE_INT_CLR_M  (LCDCAM_LCD_TRANS_DONE_INT_CLR_V << LCDCAM_LCD_TRANS_DONE_INT_CLR_S)
#define LCDCAM_LCD_TRANS_DONE_INT_CLR_V  0x00000001U
#define LCDCAM_LCD_TRANS_DONE_INT_CLR_S  1
/** LCDCAM_CAM_VSYNC_INT_CLR : WT; bitpos: [2]; default: 0;
 *  The clear bit for Camera frame end interrupt.
 */
#define LCDCAM_CAM_VSYNC_INT_CLR    (BIT(2))
#define LCDCAM_CAM_VSYNC_INT_CLR_M  (LCDCAM_CAM_VSYNC_INT_CLR_V << LCDCAM_CAM_VSYNC_INT_CLR_S)
#define LCDCAM_CAM_VSYNC_INT_CLR_V  0x00000001U
#define LCDCAM_CAM_VSYNC_INT_CLR_S  2
/** LCDCAM_CAM_HS_INT_CLR : WT; bitpos: [3]; default: 0;
 *  The clear bit for Camera line interrupt.
 */
#define LCDCAM_CAM_HS_INT_CLR    (BIT(3))
#define LCDCAM_CAM_HS_INT_CLR_M  (LCDCAM_CAM_HS_INT_CLR_V << LCDCAM_CAM_HS_INT_CLR_S)
#define LCDCAM_CAM_HS_INT_CLR_V  0x00000001U
#define LCDCAM_CAM_HS_INT_CLR_S  3
/** LCDCAM_LCD_UNDERRUN_INT_CLR : WT; bitpos: [4]; default: 0;
 *  The clear bit for LCD underrun interrupt
 */
#define LCDCAM_LCD_UNDERRUN_INT_CLR    (BIT(4))
#define LCDCAM_LCD_UNDERRUN_INT_CLR_M  (LCDCAM_LCD_UNDERRUN_INT_CLR_V << LCDCAM_LCD_UNDERRUN_INT_CLR_S)
#define LCDCAM_LCD_UNDERRUN_INT_CLR_V  0x00000001U
#define LCDCAM_LCD_UNDERRUN_INT_CLR_S  4
/** LCDCAM_CAM_OVERFLOW_INT_CLR : WT; bitpos: [5]; default: 0;
 *  The clear bit for Camera overflow interrupt
 */
#define LCDCAM_CAM_OVERFLOW_INT_CLR    (BIT(5))
#define LCDCAM_CAM_OVERFLOW_INT_CLR_M  (LCDCAM_CAM_OVERFLOW_INT_CLR_V << LCDCAM_CAM_OVERFLOW_INT_CLR_S)
#define LCDCAM_CAM_OVERFLOW_INT_CLR_V  0x00000001U
#define LCDCAM_CAM_OVERFLOW_INT_CLR_S  5

/** LCDCAM_LC_REG_DATE_REG register
 *  Version register
 */
#define LCDCAM_LC_REG_DATE_REG (DR_REG_LCDCAM_BASE + 0xfc)
/** LCDCAM_LC_DATE : R/W; bitpos: [27:0]; default: 38814224;
 *  LCD_CAM version control register
 */
#define LCDCAM_LC_DATE    0x0FFFFFFFU
#define LCDCAM_LC_DATE_M  (LCDCAM_LC_DATE_V << LCDCAM_LC_DATE_S)
#define LCDCAM_LC_DATE_V  0x0FFFFFFFU
#define LCDCAM_LC_DATE_S  0

#ifdef __cplusplus
}
#endif
